Repository: andriisoldatenko/python-docs-uk
Catalog: whatsnew/3.11.po
Languages: uk

source: Faster CPython explores optimizations for :term:`CPython`. The main team is funded by Microsoft to work on this full-time. Pablo Galindo Salgado is also funded by Bloomberg LP to work on the project part-time. Finally, many contributors are volunteers from the community.
uk: Швидший CPython досліджує оптимізацію для :term:`CPython`. Основна команда фінансується корпорацією Майкрософт для роботи над цим повний робочий день. Пабло Галіндо Сальгадо також фінансується Bloomberg LP, щоб працювати над проектом неповний робочий день. Нарешті, багато учасників є волонтерами спільноти.

source: CPython bytecode changes
uk: Зміни байт-коду CPython

source: Replaced all numeric ``BINARY_*`` and ``INPLACE_*`` instructions with a single :opcode:`BINARY_OP` implementation.
uk: Замінено всі числові інструкції ``BINARY_*`` і ``INPLACE_*`` єдиною реалізацією :opcode:`BINARY_OP`.

source: Replaced the three call instructions: :opcode:`CALL_FUNCTION`, :opcode:`CALL_FUNCTION_KW` and :opcode:`CALL_METHOD` with :opcode:`PUSH_NULL`, :opcode:`PRECALL`, :opcode:`CALL`, and :opcode:`KW_NAMES`. This decouples the argument shifting for methods from the handling of keyword arguments and allows better specialization of calls.
uk: Замінено три інструкції виклику: :opcode:`CALL_FUNCTION`, :opcode:`CALL_FUNCTION_KW` і :opcode:`CALL_METHOD` на :opcode:`PUSH_NULL`, :opcode:`PRECALL`, :opcode:`CALL` і: код операції: `KW_NAMES`. Це відокремлює зміщення аргументів для методів від обробки ключових аргументів і дозволяє краще спеціалізувати виклики.

source: Removed ``COPY_DICT_WITHOUT_KEYS`` and ``GEN_START``.
uk: Видалено ``COPY_DICT_WITHOUT_KEYS`` і ``GEN_START``.

source: :opcode:`MATCH_CLASS` and :opcode:`MATCH_KEYS` no longer push an additional boolean value indicating whether the match succeeded or failed. Instead, they indicate failure with :const:`None` (where a tuple of extracted values would otherwise be).
uk: :opcode:`MATCH_CLASS` і :opcode:`MATCH_KEYS` більше не надсилають додаткове логічне значення, яке вказує на те, успішно чи невдало збіг. Натомість вони вказують на помилку за допомогою :const:`None` (там, де інакше був би кортеж витягнутих значень).

source: Replace several stack manipulation instructions (``DUP_TOP``, ``DUP_TOP_TWO``, ``ROT_TWO``, ``ROT_THREE``, ``ROT_FOUR``, and ``ROT_N``) with new :opcode:`COPY` and :opcode:`SWAP` instructions.
uk: Замініть кілька інструкцій маніпулювання стеком (``DUP_TOP``, ``DUP_TOP_TWO``, ``ROT_TWO``, ``ROT_THREE``, ``ROT_FOUR`` і ``ROT_N``) на новий :opcode:`COPY` і :opcode:`Інструкції SWAP`.

source: Replaced :opcode:`JUMP_IF_NOT_EXC_MATCH` by :opcode:`CHECK_EXC_MATCH` which performs the check but does not jump.
uk: Замінено :opcode:`JUMP_IF_NOT_EXC_MATCH` на :opcode:`CHECK_EXC_MATCH`, який виконує перевірку, але не стрибає.

source: Replaced :opcode:`JUMP_IF_NOT_EG_MATCH` by :opcode:`CHECK_EG_MATCH` which performs the check but does not jump.
uk: Замінено :opcode:`JUMP_IF_NOT_EG_MATCH` на :opcode:`CHECK_EG_MATCH`, який виконує перевірку, але не стрибає.

source: Replaced :opcode:`JUMP_ABSOLUTE` by the relative :opcode:`JUMP_BACKWARD`.
uk: Замінено :opcode:`JUMP_ABSOLUTE` на відносний :opcode:`JUMP_BACKWARD`.

source: Added :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, which is used in certain loops where it is undesirable to handle interrupts.
uk: Додано :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, який використовується в певних циклах, де небажано обробляти переривання.

source: Replaced :opcode:`POP_JUMP_IF_TRUE` and :opcode:`POP_JUMP_IF_FALSE` by the relative :opcode:`POP_JUMP_FORWARD_IF_TRUE`, :opcode:`POP_JUMP_BACKWARD_IF_TRUE`, :opcode:`POP_JUMP_FORWARD_IF_FALSE` and :opcode:`POP_JUMP_BACKWARD_IF_FALSE`.
uk: Замінено :opcode:`POP_JUMP_IF_TRUE` і :opcode:`POP_JUMP_IF_FALSE` на відносні :opcode:`POP_JUMP_FORWARD_IF_TRUE`, :opcode:`POP_JUMP_BACKWARD_IF_TRUE`, :opcode:`POP_JUMP_FORWARD_IF_FALSE` і :opcode:`POP_JUMP_IF_BACKWARD`.

source: Added :opcode:`POP_JUMP_FORWARD_IF_NOT_NONE`, :opcode:`POP_JUMP_BACKWARD_IF_NOT_NONE`, :opcode:`POP_JUMP_FORWARD_IF_NONE` and :opcode:`POP_JUMP_BACKWARD_IF_NONE` opcodes to speed up conditional jumps.
uk: Додано коди операцій :opcode:`POP_JUMP_FORWARD_IF_NOT_NONE`, :opcode:`POP_JUMP_BACKWARD_IF_NOT_NONE`, :opcode:`POP_JUMP_FORWARD_IF_NONE` і :opcode:`POP_JUMP_BACKWARD_IF_NONE` для прискорення умовних переходів.

source: :opcode:`JUMP_IF_TRUE_OR_POP` and :opcode:`JUMP_IF_FALSE_OR_POP` are now relative rather than absolute.
uk: :opcode:`JUMP_IF_TRUE_OR_POP` і :opcode:`JUMP_IF_FALSE_OR_POP` тепер відносні, а не абсолютні.

source: Deprecated
uk: Застаріле

source: Chaining :class:`classmethod` descriptors (introduced in :issue:`19072`) is now deprecated. It can no longer be used to wrap other descriptors such as :class:`property`. The core design of this feature was flawed and caused a number of downstream problems. To "pass-through" a :class:`classmethod`, consider using the ``__wrapped__`` attribute that was added in Python 3.10. (Contributed by Raymond Hettinger in :gh:`89519`.)
uk: З’єднання дескрипторів :class:`classmethod` (введене в :issue:`19072`) тепер застаріло. Його більше не можна використовувати для обгортання інших дескрипторів, таких як :class:`property`. Основна конструкція цієї функції мала недоліки, що спричинило низку проблем у нижній частині. Щоб "пропустити" :class:`classmethod`, розгляньте можливість використання атрибута ``__wrapped__``, який було додано в Python 3.10. (Надав Реймонд Геттінгер у :gh:`89519`.)

source: Octal escapes in string and bytes literals with value larger than ``0o377`` now produce :exc:`DeprecationWarning`. In a future Python version they will be a :exc:`SyntaxWarning` and eventually a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :gh:`81548`.)
uk: Вісімкове екранування в рядкових і байтових літералах зі значенням, більшим за ``0o377``, тепер створює :exc:`DeprecationWarning`. У майбутній версії Python вони будуть :exc:`SyntaxWarning` і, зрештою, :exc:`SyntaxError`. (Надав Сергій Сторчака в :gh:`81548`.)

source: The :mod:`lib2to3` package and ``2to3`` tool are now deprecated and may not be able to parse Python 3.10 or newer. See the :pep:`617` (New PEG parser for CPython). (Contributed by Victor Stinner in :issue:`40360`.)
uk: Пакунок :mod:`lib2to3` і інструмент ``2to3`` тепер не підтримуються, і вони можуть не розбирати Python 3.10 або новішої версії. Перегляньте :pep:`617` (новий парсер PEG для CPython). (Надав Віктор Стіннер у :issue:`40360`.)

source: Undocumented modules ``sre_compile``, ``sre_constants`` and ``sre_parse`` are now deprecated. (Contributed by Serhiy Storchaka in :issue:`47152`.)
uk: Недокументовані модулі ``sre_compile``, ``sre_constants`` і ``sre_parse`` тепер застаріли. (Надав Сергій Сторчака в :issue:`47152`.)

source: :class:`webbrowser.MacOSX` is deprecated and will be removed in Python 3.13. It is untested and undocumented and also not used by webbrowser itself. (Contributed by Dong-hee Na in :issue:`42255`.)
uk: :class:`webbrowser.MacOSX` застарів і буде видалено в Python 3.13. Він не перевірений і не задокументований, а також не використовується самим веб-браузером. (Надав Dong-hee Na у :issue:`42255`.)

source: The behavior of returning a value from a :class:`~unittest.TestCase` and :class:`~unittest.IsolatedAsyncioTestCase` test methods (other than the default ``None`` value), is now deprecated.
uk: Поведінка повернення значення з тестових методів :class:`~unittest.TestCase` і :class:`~unittest.IsolatedAsyncioTestCase` (окрім значення за умовчанням ``None``) тепер застаріла.

source: Deprecated the following :mod:`unittest` functions, scheduled for removal in Python 3.13:
uk: Застаріли такі функції :mod:`unittest`, заплановані для видалення в Python 3.13:

source: Use :class:`~unittest.TestLoader` method instead:
uk: Замість цього використовуйте метод :class:`~unittest.TestLoader`:

source: (Contributed by Erlend E. Aasland in :issue:`5846`.)
uk: (Надав Erlend E. Aasland у :issue:`5846`.)

source: The :meth:`turtle.RawTurtle.settiltangle` is deprecated since Python 3.1, it now emits a deprecation warning and will be removed in Python 3.13. Use :meth:`turtle.RawTurtle.tiltangle` instead (it was earlier incorrectly marked as deprecated, its docstring is now corrected). (Contributed by Hugo van Kemenade in :issue:`45837`.)
uk: :meth:`turtle.RawTurtle.settiltangle` не підтримується з Python 3.1, тепер він видає попередження про застаріння та буде видалено в Python 3.13. Натомість використовуйте :meth:`turtle.RawTurtle.tiltangle` (раніше він був неправильно позначений як застарілий, тепер його документацію виправлено). (Надав Хуго ван Кеменаде в :issue:`45837`.)

source: The delegation of :func:`int` to :meth:`__trunc__` is now deprecated. Calling ``int(a)`` when ``type(a)`` implements :meth:`__trunc__` but not :meth:`__int__` or :meth:`__index__` now raises a :exc:`DeprecationWarning`. (Contributed by Zackery Spytz in :issue:`44977`.)
uk: Делегування :func:`int` :meth:`__trunc__` тепер застаріло. Виклик ``int(a)``, коли ``type(a)`` реалізує :meth:`__trunc__`, але не :meth:`__int__` або :meth:`__index__`, тепер викликає :exc:`DeprecationWarning`. (Надав Закері Шпітц у :issue:`44977`.)

source: The following have been deprecated in :mod:`configparser` since Python 3.2. Their deprecation warnings have now been updated to note they will removed in Python 3.12:
uk: У :mod:`configparser` з Python 3.2 застаріли наступні. Їхні попередження про припинення підтримки тепер оновлено, щоб зазначити, що вони будуть видалені в Python 3.12:

source: the :class:`configparser.SafeConfigParser` class
uk: клас :class:`configparser.SafeConfigParser`

source: the :attr:`configparser.ParsingError.filename` property
uk: властивість :attr:`configparser.ParsingError.filename`

source: the :meth:`configparser.RawConfigParser.readfp` method
uk: метод :meth:`configparser.RawConfigParser.readfp`

source: (Contributed by Hugo van Kemenade in :issue:`45173`.)
uk: (Надав Хуго ван Кеменаде в :issue:`45173`.)

source: :class:`configparser.LegacyInterpolation` has been deprecated in the docstring since Python 3.2. It now emits a :exc:`DeprecationWarning` and will be removed in Python 3.13. Use :class:`configparser.BasicInterpolation` or :class:`configparser.ExtendedInterpolation` instead. (Contributed by Hugo van Kemenade in :issue:`46607`.)
uk: :class:`configparser.LegacyInterpolation` не підтримується в рядку документації з Python 3.2. Тепер він видає :exc:`DeprecationWarning` і буде видалено в Python 3.13. Замість цього використовуйте :class:`configparser.BasicInterpolation` або :class:`configparser.ExtendedInterpolation`. (Надав Хуго ван Кеменаде в :issue:`46607`.)

source: The :func:`locale.getdefaultlocale` function is deprecated and will be removed in Python 3.13. Use :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` and :func:`locale.getlocale` functions instead. (Contributed by Victor Stinner in :gh:`90817`.)
uk: Функція :func:`locale.getdefaultlocale` є застарілою та буде видалена в Python 3.13. Замість цього використовуйте функції :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` і :func:`locale.getlocale`. (Надав Віктор Стіннер у :gh:`90817`.)

source: The :func:`locale.resetlocale` function is deprecated and will be removed in Python 3.13. Use ``locale.setlocale(locale.LC_ALL, "")`` instead. (Contributed by Victor Stinner in :gh:`90817`.)
uk: Функція :func:`locale.resetlocale` є застарілою та буде видалена в Python 3.13. Замість цього використовуйте ``locale.setlocale(locale.LC_ALL, "")``. (Надав Віктор Стіннер у :gh:`90817`.)

source: The :mod:`asynchat`, :mod:`asyncore` and :mod:`smtpd` modules have been deprecated since at least Python 3.6. Their documentation and deprecation warnings have now been updated to note they will removed in Python 3.12 (:pep:`594`). (Contributed by Hugo van Kemenade in :issue:`47022`.)
uk: Модулі :mod:`asynchat`, :mod:`asyncore` і :mod:`smtpd` є застарілими принаймні з Python 3.6. Їхню документацію та застереження щодо застарілості тепер оновлено, щоб зазначити, що вони будуть видалені в Python 3.12 (:pep:`594`). (Надав Хуго ван Кеменаде в :issue:`47022`.)

source: :pep:`594` led to the deprecations of the following modules which are slated for removal in Python 3.13:
uk: :pep:`594` призвело до припинення підтримки таких модулів, які планується видалити в Python 3.13:

source: (Contributed by Brett Cannon in :issue:`47061` and Victor Stinner in :gh:`68966`.)
uk: (Надано Бреттом Кенноном у :issue:`47061` та Віктором Стіннером у :gh:`68966`.)

source: More strict rules will be applied now applied for numerical group references and group names in regular expressions in future Python versions. Only sequence of ASCII digits will be now accepted as a numerical reference. The group name in bytes patterns and replacement strings could only contain ASCII letters and digits and underscore. For now, a deprecation warning is raised for such syntax. (Contributed by Serhiy Storchaka in :gh:`91760`.)
uk: Тепер для посилань на числові групи та імен груп у регулярних виразах у майбутніх версіях Python застосовуватимуться більш суворі правила. Лише послідовність цифр ASCII тепер прийматиметься як числове посилання. Назва групи в шаблонах байтів і рядках заміни може містити лише літери та цифри ASCII і підкреслення. Наразі для такого синтаксису надсилається попередження про застаріле. (Надав Сергій Сторчака в :gh:`91760`.)

source: :class:`typing.Text`, which exists solely to provide compatibility support between Python 2 and Python 3 code, is now deprecated. Its removal is currently unplanned, but users are encouraged to use :class:`str` instead wherever possible. (Contributed by Alex Waygood in :gh:`92332`.)
uk: :class:`typing.Text`, який існує виключно для підтримки сумісності між кодами Python 2 і Python 3, тепер не підтримується. Його видалення наразі не планується, але користувачам рекомендується використовувати :class:`str` натомість, де це можливо. (Надав Алекс Вейгуд у :gh:`92332`.)

source: The keyword argument syntax for constructing :data:`~typing.TypedDict` types is now deprecated. Support will be removed in Python 3.13. (Contributed by Jingchen Ye in :gh:`90224`.)
uk: Синтаксис ключового аргументу для побудови типів :data:`~typing.TypedDict` тепер застарів. У Python 3.13 підтримку буде припинено. (Надав Jingchen Ye у :gh:`90224`.)

source: The :func:`re.template` function and the corresponding :const:`re.TEMPLATE` and :const:`re.T` flags are deprecated, as they were undocumented and lacked an obvious purpose. They will be removed in Python 3.13. (Contributed by Serhiy Storchaka and Miro Hrončok in :gh:`92728`.)
uk: Функція :func:`re.template` і відповідні прапорці :const:`re.TEMPLATE` і :const:`re.T` застаріли, оскільки вони були незадокументовані та не мали очевидної мети. Їх буде видалено в Python 3.13. (Надано Сергієм Сторчакою та Міро Хрончок у :gh:`92728`.)

source: Pending Removal in Python 3.12
uk: Очікує на видалення в Python 3.12

source: The following APIs have been deprecated in earlier Python releases, and will be removed in Python 3.12.
uk: У попередніх версіях Python наведені нижче API-інтерфейси застаріли та будуть видалені в Python 3.12.

source: Python API:
uk: API Python:

source: The entire :ref:`distutils namespace <distutils-deprecated>`
uk: Весь :ref:`простір імен distutils <distutils-deprecated>`

source: Removed
uk: Видалено

source: :class:`smtpd.MailmanProxy` is now removed as it is unusable without an external module, ``mailman``. (Contributed by Dong-hee Na in :issue:`35800`.)
uk: :class:`smtpd.MailmanProxy` тепер видалено, оскільки його не можна використовувати без зовнішнього модуля, ``mailman``. (Надав Dong-hee Na у :issue:`35800`.)

source: The ``binhex`` module, deprecated in Python 3.9, is now removed. The following :mod:`binascii` functions, deprecated in Python 3.9, are now also removed:
uk: Модуль ``binhex``, застарілий у Python 3.9, тепер видалено. Наступні функції :mod:`binascii`, застарілі в Python 3.9, тепер також видалено:

source: The :func:`binascii.crc_hqx` function remains available.
uk: Функція :func:`binascii.crc_hqx` залишається доступною.

source: (Contributed by Victor Stinner in :issue:`45085`.)
uk: (Надав Віктор Стіннер у :issue:`45085`.)

source: The distutils ``bdist_msi`` command, deprecated in Python 3.9, is now removed. Use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`45124`.)
uk: Команда distutils ``bdist_msi``, застаріла в Python 3.9, тепер видалена. Натомість використовуйте ``bdist_wheel`` (пакети коліс). (Надав Хуго ван Кеменаде в :issue:`45124`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint`, disabled in Python 3.9, is now entirely removed. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. (Contributed by Hugo van Kemenade in :issue:`45129`.)
uk: Через серйозні проблеми безпеки параметр *reuse_address* :meth:`asyncio.loop.create_datagram_endpoint`, вимкнений у Python 3.9, тепер повністю видалено. Це через поведінку опції сокета ``SO_REUSEADDR`` в UDP. (Надав Хуго ван Кеменаде в :issue:`45129`.)

source: Removed :meth:`__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput`, deprecated since Python 3.9. (Contributed by Hugo van Kemenade in :issue:`45132`.)
uk: Видалено :meth:`__getitem__` методи :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` і :class:`fileinput.FileInput`, застарілі з Python 3.9. (Надав Хуго ван Кеменаде в :issue:`45132`.)

source: The following deprecated functions and methods are removed in the :mod:`gettext` module: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` and :func:`~gettext.ldngettext`.
uk: Наступні застарілі функції та методи видалено в модулі :mod:`gettext`: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` і :func:`~gettext.ldngettext`.

source: Function :func:`~gettext.bind_textdomain_codeset`, methods :meth:`~gettext.NullTranslations.output_charset` and :meth:`~gettext.NullTranslations.set_output_charset`, and the *codeset* parameter of functions :func:`~gettext.translation` and :func:`~gettext.install` are also removed, since they are only used for the ``l*gettext()`` functions. (Contributed by Dong-hee Na and Serhiy Storchaka in :issue:`44235`.)
uk: Функція :func:`~gettext.bind_textdomain_codeset`, методи :meth:`~gettext.NullTranslations.output_charset` і :meth:`~gettext.NullTranslations.set_output_charset`, а також параметр *codeset* функцій :func:`~gettext .translation` і :func:`~gettext.install` також видаляються, оскільки вони використовуються лише для функцій ``l*gettext()``. (Надано Dong-hee Na та Сергієм Сторчакою в :issue:`44235`.)

source: The :func:`@asyncio.coroutine <asyncio.coroutine>` :term:`decorator` enabling legacy generator-based coroutines to be compatible with async/await code. The function has been deprecated since Python 3.8 and the removal was initially scheduled for Python 3.10. Use :keyword:`async def` instead. (Contributed by Illia Volochii in :issue:`43216`.)
uk: :func:`@asyncio.coroutine <asyncio.coroutine>` :term:`decorator`, що дозволяє застарілим співпрограмам на основі генератора бути сумісними з кодом async/await. Ця функція застаріла з Python 3.8, і видалення спочатку було заплановано для Python 3.10. Натомість використовуйте :keyword:`async def`. (Надав Ілля Волочій у :issue:`43216`.)

source: :class:`asyncio.coroutines.CoroWrapper` used for wrapping legacy generator-based coroutine objects in the debug mode. (Contributed by Illia Volochii in :issue:`43216`.)
uk: :class:`asyncio.coroutines.CoroWrapper` використовується для обгортання застарілих об’єктів співпрограми на основі генератора в режимі налагодження. (Надав Ілля Волочій у :issue:`43216`.)

source: Removed the deprecated ``split()`` method of :class:`_tkinter.TkappType`. (Contributed by Erlend E. Aasland in :issue:`38371`.)
uk: Видалено застарілий метод ``split()`` :class:`_tkinter.TkappType`. (Надав Erlend E. Aasland у :issue:`38371`.)

source: Removed from the :mod:`inspect` module:
uk: Видалено з модуля :mod:`inspect`:

source: the ``getargspec`` function, deprecated since Python 3.0; use :func:`inspect.signature` or :func:`inspect.getfullargspec` instead.
uk: функція ``getargspec``, застаріла з Python 3.0; замість цього використовуйте :func:`inspect.signature` або :func:`inspect.getfullargspec`.

source: the ``formatargspec`` function, deprecated since Python 3.5; use the :func:`inspect.signature` function and :class:`Signature` object directly.
uk: функція ``formatargspec``, застаріла з Python 3.5; безпосередньо використовуйте функцію :func:`inspect.signature` і об’єкт :class:`Signature`.

source: the undocumented ``Signature.from_builtin`` and ``Signature.from_function`` functions, deprecated since Python 3.5; use the :meth:`Signature.from_callable() <inspect.Signature.from_callable>` method instead.
uk: недокументовані функції ``Signature.from_builtin`` і ``Signature.from_function``, застарілі з Python 3.5; замість цього використовуйте метод :meth:`Signature.from_callable() <inspect.Signature.from_callable>`.

source: (Contributed by Hugo van Kemenade in :issue:`45320`.)
uk: (Надав Хуго ван Кеменаде в :issue:`45320`.)

source: Remove namespace package support from unittest discovery. It was introduced in Python 3.4 but has been broken since Python 3.7. (Contributed by Inada Naoki in :issue:`23882`.)
uk: Видалити підтримку пакета простору імен із виявлення unittest. Він був представлений у Python 3.4, але не працює з Python 3.7. (Надано Інадою Наокі в :issue:`23882`.)

source: Remove ``__class_getitem__`` method from :class:`pathlib.PurePath`, because it was not used and added by mistake in previous versions. (Contributed by Nikita Sobolev in :issue:`46483`.)
uk: Видаліть метод ``__class_getitem__`` з :class:`pathlib.PurePath`, тому що він не використовувався та був доданий помилково в попередніх версіях. (Надав Микита Соболєв у :issue:`46483`.)

source: Remove the undocumented private ``float.__set_format__()`` method, previously known as ``float.__setformat__()`` in Python 3.7. Its docstring said: "You probably don't want to use this function. It exists mainly to be used in Python's test suite." (Contributed by Victor Stinner in :issue:`46852`.)
uk: Видаліть недокументований приватний метод ``float.__set_format__()``, раніше відомий як ``float.__setformat__()`` у Python 3.7. У його документації було написано: "Ви, мабуть, не хочете використовувати цю функцію. Вона існує в основному для використання в наборі тестів Python". (Надав Віктор Стіннер у :issue:`46852`.)

source: The ``--experimental-isolated-subinterpreters`` configure flag (and corresponding ``EXPERIMENTAL_ISOLATED_SUBINTERPRETERS``) have been removed.
uk: Прапор конфігурації ``--experimental-isolated-subinterpreters`` (і відповідний ``EXPERIMENTAL_ISOLATED_SUBINTERPRETERS``) видалено.

source: Porting to Python 3.11
uk: Перенесення на Python 3.11

source: This section lists previously described changes and other bugfixes that may require changes to your code.
uk: У цьому розділі наведено описані раніше зміни та інші виправлення помилок, які можуть потребувати змін у вашому коді.

source: Changes in the Python API
uk: Зміни в API Python

source: Prohibited passing non-:class:`concurrent.futures.ThreadPoolExecutor` executors to :meth:`loop.set_default_executor` following a deprecation in Python 3.8. (Contributed by Illia Volochii in :issue:`43234`.)
uk: Заборонено передачу не :class:`concurrent.futures.ThreadPoolExecutor` виконавців до :meth:`loop.set_default_executor` після застарілої версії Python 3.8. (Надав Ілля Волочій у :issue:`43234`.)
