Repository: andriisoldatenko/python-docs-uk
Catalog: whatsnew/3.11.po
Languages: uk

source: What's New In Python 3.11
uk: Що нового в Python 3.11

source: Release
uk: Реліз

source: Date
uk: Дата

source: This article explains the new features in Python 3.11, compared to 3.10.
uk: У цій статті пояснюється нові функції в Python 3.11 порівняно з 3.10.

source: For full details, see the :ref:`changelog <changelog>`.
uk: Щоб отримати повну інформацію, перегляньте :ref:`журнал змін <changelog>`.

source: Prerelease users should be aware that this document is currently in draft form. It will be updated substantially as Python 3.11 moves towards release, so it's worth checking back even after reading earlier versions.
uk: Користувачі попередніх версій повинні знати, що цей документ наразі є чернеткою. Його буде суттєво оновлено, коли Python 3.11 наближається до випуску, тому варто перевірити його навіть після прочитання попередніх версій.

source: Summary -- Release highlights
uk: Підсумок – основні моменти випуску

source: Python 3.11 is up to 10-60% faster than Python 3.10. On average, we measured a 1.25x speedup on the standard benchmark suite. See `Faster CPython`_ for details.
uk: Python 3.11 на 10-60% швидший за Python 3.10. У середньому ми виміряли прискорення стандартного тесту в 1,25 раза. Перегляньте `Faster CPython`_ для деталей.

source: New syntax features:
uk: Нові функції синтаксису:

source: :pep:`654`: Exception Groups and ``except*``. (Contributed by Irit Katriel in :issue:`45292`.)
uk: :pep:`654`: Групи винятків і ``except*``. (Надано Іріт Катріель у :issue:`45292`.)

source: New typing features:
uk: Нові функції набору тексту:

source: :pep:`646`: Variadic generics.
uk: :pep:`646`: Різноманітні генерики.

source: :pep:`655`: Marking individual TypedDict items as required or potentially-missing.
uk: :pep:`655`: Позначення окремих елементів TypedDict як обов’язкових або потенційно відсутніх.

source: :pep:`673`: ``Self`` type.
uk: :pep:`673`: Тип ``Self``.

source: :pep:`675`: Arbitrary literal string type.
uk: :pep:`675`: Довільний тип рядка літералу.

source: Security improvements:
uk: Покращення безпеки:

source: New :option:`-P` command line option and :envvar:`PYTHONSAFEPATH` environment variable to not prepend a potentially unsafe path to :data:`sys.path` such as the current directory, the script's directory or an empty string.
uk: Новий параметр командного рядка :option:`-P` і змінна середовища :envvar:`PYTHONSAFEPATH`, щоб не додавати потенційно небезпечний шлях до :data:`sys.path`, як-от поточний каталог, каталог сценарію або порожній рядок.

source: New Features
uk: Нові можливості

source: Enhanced error locations in tracebacks
uk: Покращено розташування помилок у зворотному відстеженні

source: When printing tracebacks, the interpreter will now point to the exact expression that caused the error instead of just the line. For example:
uk: Під час друку трасування інтерпретатор тепер вказуватиме на точний вираз, який спричинив помилку, а не лише на рядок. Наприклад:

source: Previous versions of the interpreter would point to just the line making it ambiguous which object was ``None``. These enhanced errors can also be helpful when dealing with deeply nested dictionary objects and multiple function calls,
uk: Попередні версії інтерпретатора вказували лише на рядок, роблячи неоднозначним те, який об’єкт був ``None``. Ці розширені помилки також можуть бути корисними при роботі з глибоко вкладеними об’єктами словника та кількома викликами функцій,

source: as well as complex arithmetic expressions:
uk: а також складні арифметичні вирази:

source: See :pep:`657` for more details. (Contributed by Pablo Galindo, Batuhan Taskaya and Ammar Askar in :issue:`43950`.)
uk: Дивіться :pep:`657` для більш детальної інформації. (Надано Пабло Галіндо, Батуханом Таською та Аммаром Аскаром у :issue:`43950`.)

source: This feature requires storing column positions in code objects which may result in a small increase of disk usage of compiled Python files or interpreter memory usage. To avoid storing the extra information and/or deactivate printing the extra traceback information, the :option:`-X` ``no_debug_ranges`` command line flag or the :envvar:`PYTHONNODEBUGRANGES` environment variable can be used.
uk: Ця функція вимагає зберігання позицій стовпців в об’єктах коду, що може призвести до невеликого збільшення використання диска для скомпільованих файлів Python або використання пам’яті інтерпретатора. Щоб уникнути збереження додаткової інформації та/або дезактивувати друк додаткової інформації про відстеження, можна використовувати прапор командного рядка :option:`-X` ``no_debug_ranges`` або змінну середовища :envvar:`PYTHONNODEBUGRANGES`.

source: Column information for code objects
uk: Інформація про стовпець для об’єктів коду

source: The information used by the enhanced traceback feature is made available as a general API that can be used to correlate bytecode instructions with source code. This information can be retrieved using:
uk: Інформація, яка використовується розширеною функцією відстеження, доступна як загальний API, який можна використовувати для співвіднесення інструкцій байт-коду з вихідним кодом. Цю інформацію можна отримати за допомогою:

source: The :meth:`codeobject.co_positions` method in Python.
uk: Метод :meth:`codeobject.co_positions` в Python.

source: The :c:func:`PyCode_Addr2Location` function in the C-API.
uk: Функція :c:func:`PyCode_Addr2Location` в C-API.

source: The :option:`-X` ``no_debug_ranges`` option and the environment variable :envvar:`PYTHONNODEBUGRANGES` can be used to disable this feature.
uk: Параметр :option:`-X` ``no_debug_ranges`` і змінна середовища :envvar:`PYTHONNODEBUGRANGES` можна використовувати для вимкнення цієї функції.

source: Exceptions can be enriched with notes (PEP 678)
uk: Винятки можуть бути збагачені примітками (PEP 678)

source: The :meth:`add_note` method was added to :exc:`BaseException`. It can be used to enrich exceptions with context information which is not available at the time when the exception is raised. The notes added appear in the default traceback. See :pep:`678` for more details. (Contributed by Irit Katriel in :issue:`45607`.)
uk: Метод :meth:`add_note` додано до :exc:`BaseException`. Він може бути використаний для збагачення винятків контекстною інформацією, яка недоступна на момент виникнення винятку. Додані примітки відображаються у зворотній трасуванні за замовчуванням. Дивіться :pep:`678` для більш детальної інформації. (Надано Іріт Катріель у :issue:`45607`.)

source: New Features Related to Type Hints
uk: Нові функції, пов’язані з підказками типу

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
uk: У цьому розділі розглядаються основні зміни, що стосуються підказок типу :pep:`484` і модуля :mod:`typing`.

source: PEP 646: Variadic generics
uk: PEP 646: різноманітні генерики

source: :pep:`484` introduced :data:`~typing.TypeVar`, enabling creation of generics parameterised with a single type. :pep:`646` introduces :data:`~typing.TypeVarTuple`, enabling parameterisation with an *arbitrary* number of types. In other words, a :data:`~typing.TypeVarTuple` is a *variadic* type variable, enabling *variadic* generics. This enables a wide variety of use cases. In particular, it allows the type of array-like structures in numerical computing libraries such as NumPy and TensorFlow to be parameterised with the array *shape*. Static type checkers will now be able to catch shape-related bugs in code that uses these libraries.
uk: :pep:`484` представлено :data:`~typing.TypeVar`, що дозволяє створювати генерики, параметризовані одним типом. :pep:`646` представляє :data:`~typing.TypeVarTuple`, що дозволяє параметризувати *довільну* кількість типів. Іншими словами, :data:`~typing.TypeVarTuple` є змінною *variadic* типу, що дозволяє *variadic* генерики. Це забезпечує широку різноманітність випадків використання. Зокрема, це дозволяє параметризувати тип структур, подібних до масиву, у бібліотеках числових обчислень, таких як NumPy і TensorFlow, за допомогою масиву *shape*. Засоби перевірки статичних типів тепер зможуть виявляти помилки, пов’язані з формою, у коді, який використовує ці бібліотеки.

source: See :pep:`646` for more details.
uk: Дивіться :pep:`646` для більш детальної інформації.

source: (Contributed by Matthew Rahtz in :issue:`43224`, with contributions by Serhiy Storchaka and Jelle Zijlstra. PEP written by Mark Mendoza, Matthew Rahtz, Pradeep Kumar Srinivasan, and Vincent Siles.)
uk: (Надано Метью Ратцем у :issue:`43224`, внески Сергія Сторчаки та Джелле Зійлстри. Автори PEP — Марк Мендоза, Метью Ратц, Прадіп Кумар Срінівасан і Вінсент Сайлс.)

source: PEP 655: Marking individual ``TypedDict`` items as required or not-required
uk: PEP 655: Позначення окремих елементів ``TypedDict`` як обов’язкових чи непотрібних

source: :data:`~typing.Required` and :data:`~typing.NotRequired` provide a straightforward way to mark whether individual items in a :data:`~typing.TypedDict` must be present. Previously this was only possible using inheritance.
uk: :data:`~typing.Required` і :data:`~typing.NotRequired` забезпечують простий спосіб позначити, чи мають бути присутні окремі елементи в :data:`~typing.TypedDict`. Раніше це було можливо лише за допомогою успадкування.

source: Fields are still required by default, unless the ``total=False`` parameter is set. For example, the following specifies a dictionary with one required and one not-required key::
uk: Поля все ще є обов’язковими за замовчуванням, якщо не встановлено параметр ``total=False``. Наприклад, наступне визначає словник з одним обов’язковим і одним необов’язковим ключем::

source: The following definition is equivalent::
uk: Наступне визначення еквівалентне:

source: See :pep:`655` for more details.
uk: Дивіться :pep:`655` для більш детальної інформації.

source: (Contributed by David Foster and Jelle Zijlstra in :issue:`47087`. PEP written by David Foster.)
uk: (Надано Девідом Фостером і Джелле Зійлстра в :issue:`47087`. PEP написав Девід Фостер.)

source: PEP 673: ``Self`` type
uk: PEP 673: тип ``Self``

source: The new :data:`~typing.Self` annotation provides a simple and intuitive way to annotate methods that return an instance of their class. This behaves the same as the :data:`~typing.TypeVar`-based approach specified in :pep:`484` but is more concise and easier to follow.
uk: Нова анотація :data:`~typing.Self` забезпечує простий та інтуїтивно зрозумілий спосіб анотації методів, які повертають екземпляр свого класу. Це працює так само, як підхід на основі :data:`~typing.TypeVar`, визначений у :pep:`484`, але є більш лаконічним і легшим для дотримання.

source: Common use cases include alternative constructors provided as classmethods and :meth:`~object.__enter__` methods that return ``self``::
uk: Загальні випадки використання включають альтернативні конструктори, надані як методи класу та методи :meth:`~object.__enter__`, які повертають ``self``::

source: :data:`~typing.Self` can also be used to annotate method parameters or attributes of the same type as their enclosing class.
uk: :data:`~typing.Self` також можна використовувати для анотування параметрів методу або атрибутів того самого типу, що й клас, що їх охоплює.

source: See :pep:`673` for more details.
uk: Дивіться :pep:`673` для більш детальної інформації.

source: (Contributed by James Hilton-Balfe in :issue:`46534`. PEP written by Pradeep Kumar Srinivasan and James Hilton-Balfe.)
uk: (Надав Джеймс Хілтон-Балф у :issue:`46534`. PEP написали Прадіп Кумар Срінівасан і Джеймс Хілтон-Балф.)

source: PEP 675: Arbitrary literal string type
uk: PEP 675: довільний тип рядка літералу

source: The new :data:`~typing.LiteralString` annotation may be used to indicate that a function parameter can be of any literal string type. This allows a function to accept arbitrary literal string types, as well as strings created from other literal strings. Type checkers can then enforce that sensitive functions, such as those that execute SQL statements or shell commands, are called only with static arguments, providing protection against injection attacks.
uk: Нову анотацію :data:`~typing.LiteralString` можна використовувати, щоб вказати, що параметр функції може мати будь-який літеральний рядковий тип. Це дозволяє функції приймати довільні літеральні типи рядків, а також рядки, створені з інших літеральних рядків. Потім засоби перевірки типів можуть забезпечити виклик конфіденційних функцій, таких як ті, що виконують оператори SQL або команди оболонки, лише зі статичними аргументами, забезпечуючи захист від атак ін’єкцій.

source: For example, a SQL query function could be annotated as follows::
uk: Наприклад, функція запиту SQL може бути анотована таким чином:

source: See :pep:`675` for more details.
uk: Дивіться :pep:`675` для більш детальної інформації.

source: (Contributed by Jelle Zijlstra in :issue:`47088`. PEP written by Pradeep Kumar Srinivasan and Graham Bleaney.)
uk: (Надав Джелле Зійлстра в :issue:`47088`. PEP написали Прадіп Кумар Срінівасан і Грем Бліні.)

source: PEP 681: Data Class Transforms
uk: PEP 681: Перетворення класу даних

source: :data:`~typing.dataclass_transform` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class, giving it :func:`dataclasses.dataclass`-like behaviors.
uk: :data:`~typing.dataclass_transform` можна використовувати для декорування класу, метакласу або функції, яка сама є декоратором. Наявність ``@dataclass_transform()`` повідомляє засобу перевірки статичного типу, що оформлений об’єкт виконує "магію" під час виконання, яка перетворює клас, надаючи йому :func:`dataclasses.dataclass`-подібну поведінку.

source: For example::
uk: Наприклад::

source: See :pep:`681` for more details.
uk: Дивіться :pep:`681` для більш детальної інформації.

source: (Contributed by Jelle Zijlstra in :gh:`91860`. PEP written by Erik De Bonte and Eric Traut.)
uk: (Надано Jelle Zijlstra у :gh:`91860`. PEP автори Ерік Де Бонте та Ерік Траут.)

source: Other Language Changes
uk: Інші зміни мови

source: Starred expressions can be used in :ref:`for statements<for>`. (See :issue:`46725` for more details.)
uk: Вирази із зірочкою можна використовувати в :ref:`for statements <for>`. (Додаткову інформацію див. :issue:`46725`.)

source: Asynchronous comprehensions are now allowed inside comprehensions in asynchronous functions. Outer comprehensions implicitly become asynchronous. (Contributed by Serhiy Storchaka in :issue:`33346`.)
uk: Асинхронне розуміння тепер дозволено всередині розуміння в асинхронних функціях. Зовнішнє розуміння неявно стає асинхронним. (Надав Сергій Сторчака в :issue:`33346`.)

source: A :exc:`TypeError` is now raised instead of an :exc:`AttributeError` in :meth:`contextlib.ExitStack.enter_context` and :meth:`contextlib.AsyncExitStack.enter_async_context` for objects which do not support the :term:`context manager` or :term:`asynchronous context manager` protocols correspondingly. (Contributed by Serhiy Storchaka in :issue:`44471`.)
uk: Помилка :exc:`TypeError` тепер виникає замість :exc:`AttributeError` у :meth:`contextlib.ExitStack.enter_context` і :meth:`contextlib.AsyncExitStack.enter_async_context` для об’єктів, які не підтримують протоколи :term:`context manager` або :term:`asynchronous context manager` відповідно. (Надав Сергій Сторчака в :issue:`44471`.)

source: A :exc:`TypeError` is now raised instead of an :exc:`AttributeError` in :keyword:`with` and :keyword:`async with` statements for objects which do not support the :term:`context manager` or :term:`asynchronous context manager` protocols correspondingly. (Contributed by Serhiy Storchaka in :issue:`12022`.)
uk: Тепер виникає :exc:`TypeError` замість :exc:`AttributeError` в операторах :keyword:`with` і :keyword:`async with` для об’єктів, які не підтримують :term:`context manager` або :term:`asynchronous context manager` протоколи відповідно. (Надав Сергій Сторчака в :issue:`12022`.)

source: Added :meth:`object.__getstate__` which provides the default implementation of the ``__getstate__()`` method. :mod:`Copying <copy>` and :mod:`pickling <pickle>` instances of subclasses of builtin types :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict`, :class:`collections.deque`, :class:`weakref.WeakSet`, and :class:`datetime.tzinfo` now copies and pickles instance attributes implemented as :term:`slots <__slots__>`. (Contributed by Serhiy Storchaka in :issue:`26579`.)
uk: Додано :meth:`object.__getstate__`, який забезпечує стандартну реалізацію методу ``__getstate__()``. :mod:`Копіювання <copy>` та :mod:`піклінг <pickle>` екземплярів підкласів вбудованих типів :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict` , :class:`collections.deque`, :class:`weakref.WeakSet` і :class:`datetime.tzinfo` тепер копіює та маринує атрибути екземплярів, реалізовані як :term:`slots <__slots__>`. (Надав Сергій Сторчака в :issue:`26579`.)

source: Add :option:`-P` command line option and :envvar:`PYTHONSAFEPATH` environment variable to not prepend a potentially unsafe path to :data:`sys.path` such as the current directory, the script's directory or an empty string. (Contributed by Victor Stinner in :gh:`57684`.)
uk: Додайте параметр командного рядка :option:`-P` і змінну середовища :envvar:`PYTHONSAFEPATH`, щоб не додавати потенційно небезпечний шлях до :data:`sys.path`, як-от поточний каталог, каталог сценарію або порожній рядок. (Надав Віктор Стіннер у :gh:`57684`.)

source: A ``"z"`` option was added to the format specification mini-language that coerces negative zero to zero after rounding to the format precision. See :pep:`682` for more details. (Contributed by John Belmonte in :gh:`90153`.)
uk: Опцію ``"z"`` було додано до міні-мови специфікації формату, яка приводить негативний нуль до нуля після округлення до точності формату. Дивіться :pep:`682` для більш детальної інформації. (Надав Джон Белмонте в :gh:`90153`.)

source: Other CPython Implementation Changes
uk: Інші зміни в реалізації CPython

source: Special methods :meth:`complex.__complex__` and :meth:`bytes.__bytes__` are implemented to support :class:`typing.SupportsComplex` and :class:`typing.SupportsBytes` protocols. (Contributed by Mark Dickinson and Dong-hee Na in :issue:`24234`.)
uk: Спеціальні методи :meth:`complex.__complex__` і :meth:`bytes.__bytes__` реалізовані для підтримки протоколів :class:`typing.SupportsComplex` і :class:`typing.SupportsBytes`. (Надано Марком Дікінсоном і Донг Хі На в :issue:`24234`.)

source: ``siphash13`` is added as a new internal hashing algorithms. It has similar security properties as ``siphash24`` but it is slightly faster for long inputs. ``str``, ``bytes``, and some other types now use it as default algorithm for :func:`hash`. :pep:`552` hash-based pyc files now use ``siphash13``, too. (Contributed by Inada Naoki in :issue:`29410`.)
uk: ``siphash13`` додано як новий внутрішній алгоритм хешування. Він має такі ж властивості безпеки, як і ``siphash24``, але він трохи швидший для довгих вводів. ``str``, ``bytes`` та деякі інші типи тепер використовують його як типовий алгоритм для :func:`hash`. :pep:`552` Файли pyc на основі хешу тепер також використовують ``siphash13``. (Надано Інадою Наокі в :issue:`29410`.)

source: When an active exception is re-raised by a :keyword:`raise` statement with no parameters, the traceback attached to this exception is now always ``sys.exc_info()[1].__traceback__``. This means that changes made to the traceback in the current :keyword:`except` clause are reflected in the re-raised exception. (Contributed by Irit Katriel in :issue:`45711`.)
uk: Коли активний виняток повторно викликається оператором :keyword:`raise` без параметрів, зворотне відстеження, приєднане до цього винятку, тепер завжди ``sys.exc_info()[1].__traceback__``. Це означає, що зміни, внесені до зворотного відстеження в поточному реченні :keyword:`except`, відображаються у повторно створеному винятку. (Надано Іріт Катріель у :issue:`45711`.)

source: The interpreter state's representation of handled exceptions (a.k.a exc_info, or _PyErr_StackItem) now has only the ``exc_value`` field, ``exc_type`` and ``exc_traceback`` have been removed as their values can be derived from ``exc_value``. (Contributed by Irit Katriel in :issue:`45711`.)
uk: Представлення оброблених винятків у стані інтерпретатора (так відоме як exc_info або _PyErr_StackItem) тепер має лише поле ``exc_value``, ``exc_type`` і ``exc_traceback`` видалено, оскільки їх значення можна отримати з ``exc_value``. (Надано Іріт Катріель у :issue:`45711`.)

source: A new command line option for the Windows installer ``AppendPath`` has been added. It behaves similiar to ``PrependPath`` but appends the install and scripts directories instead of prepending them. (Contributed by Bastian Neuburger in :issue:`44934`.)
uk: Додано новий параметр командного рядка для інсталятора Windows ``AppendPath``. Він поводиться подібно до ``PrependPath``, але додає каталоги install і scripts замість того, щоб додавати їх. (Надав Бастіан Нойбургер у :issue:`44934`.)

source: The :c:member:`PyConfig.module_search_paths_set` field must now be set to 1 for initialization to use :c:member:`PyConfig.module_search_paths` to initialize :data:`sys.path`. Otherwise, initialization will recalculate the path and replace any values added to ``module_search_paths``.
uk: Поле :c:member:`PyConfig.module_search_paths_set` тепер має бути встановлено на 1 для ініціалізації, щоб використовувати :c:member:`PyConfig.module_search_paths` для ініціалізації :data:`sys.path`. В іншому випадку ініціалізація перерахує шлях і замінить будь-які значення, додані до ``module_search_paths``.

source: New Modules
uk: Нові модулі

source: A new module, :mod:`tomllib`, was added for parsing TOML. (Contributed by Taneli Hukkinen in :issue:`40059`.)
uk: Для аналізу TOML додано новий модуль :mod:`tomllib`. (Надано Танелі Хуккінен у :issue:`40059`.)

source: :mod:`wsgiref.types`, containing WSGI-specific types for static type checking, was added. (Contributed by Sebastian Rittau in :issue:`42012`.)
uk: Додано :mod:`wsgiref.types`, що містить специфічні для WSGI типи для перевірки статичних типів. (Надав Себастьян Ріттау в :issue:`42012`.)

source: Improved Modules
uk: Покращені модулі

source: Add raw datagram socket functions to the event loop: :meth:`~asyncio.AbstractEventLoop.sock_sendto`, :meth:`~asyncio.AbstractEventLoop.sock_recvfrom` and :meth:`~asyncio.AbstractEventLoop.sock_recvfrom_into`. (Contributed by Alex Grönholm in :issue:`46805`.)
uk: Додайте необроблені функції сокетів дейтаграм до циклу подій: :meth:`~asyncio.AbstractEventLoop.sock_sendto`, :meth:`~asyncio.AbstractEventLoop.sock_recvfrom` і :meth:`~asyncio.AbstractEventLoop.sock_recvfrom_into`. (Надав Алекс Грьонхольм у :issue:`46805`.)

source: Add :meth:`~asyncio.streams.StreamWriter.start_tls` method for upgrading existing stream-based connections to TLS. (Contributed by Ian Good in :issue:`34975`.)
uk: Додайте метод :meth:`~asyncio.streams.StreamWriter.start_tls` для оновлення існуючих з’єднань на основі потоку до TLS. (Надав Ян Гуд у :issue:`34975`.)

source: Add :class:`~asyncio.Barrier` class to the synchronization primitives of the asyncio library. (Contributed by Yves Duprat and Andrew Svetlov in :gh:`87518`.)
uk: Додайте клас :class:`~asyncio.Barrier` до примітивів синхронізації бібліотеки asyncio. (Надано Івом Дюпра та Ендрю Свєтловим у :gh:`87518`.)

source: datetime
uk: дата, час
