Repository: andriisoldatenko/python-docs-uk
Catalog: whatsnew/3.11.po
Languages: uk

source: :func:`typing.get_type_hints` now supports evaluating bare stringified :data:`~typing.ClassVar` annotations. (Contributed by Gregory Beauregard in :gh:`90711`.)
uk: :func:`typing.get_type_hints` тепер підтримує оцінку голих рядкових :data:`~typing.ClassVar` анотацій. (Надав Грегорі Борегард у :gh:`90711`.)

source: :func:`typing.no_type_check` no longer modifies external classes and functions. It also now correctly marks classmethods as not to be type checked. (Contributed by Nikita Sobolev in :gh:`90729`.)
uk: :func:`typing.no_type_check` більше не змінює зовнішні класи та функції. Тепер він також правильно позначає методи класу як такі, що не підлягають перевірці типу. (Надав Микита Соболєв у :gh:`90729`.)

source: Added method ``info_patchlevel()`` which returns the exact version of the Tcl library as a named tuple similar to :data:`sys.version_info`. (Contributed by Serhiy Storchaka in :gh:`91827`.)
uk: Додано метод ``info_patchlevel()``, який повертає точну версію бібліотеки Tcl як іменований кортеж, схожий на :data:`sys.version_info`. (Надав Сергій Сторчака в :gh:`91827`.)

source: The Unicode database has been updated to version 14.0.0. (:issue:`45190`).
uk: Базу даних Unicode оновлено до версії 14.0.0. (:issue:`45190`).

source: Added methods :meth:`~unittest.TestCase.enterContext` and :meth:`~unittest.TestCase.enterClassContext` of class :class:`~unittest.TestCase`, method :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` of class :class:`~unittest.IsolatedAsyncioTestCase` and function :func:`unittest.enterModuleContext`. (Contributed by Serhiy Storchaka in :issue:`45046`.)
uk: Додано методи :meth:`~unittest.TestCase.enterContext` і :meth:`~unittest.TestCase.enterClassContext` класу :class:`~unittest.TestCase`, метод :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` клас :class:`~unittest.IsolatedAsyncioTestCase` і функція :func:`unittest.enterModuleContext`. (Надав Сергій Сторчака в :issue:`45046`.)

source: When new Python virtual environments are created, the *venv* :ref:`sysconfig installation scheme <installation_paths>` is used to determine the paths inside the environment. When Python runs in a virtual environment, the same installation scheme is the default. That means that downstream distributors can change the default sysconfig install scheme without changing behavior of virtual environments. Third party code that also creates new virtual environments should do the same. (Contributed by Miro Hrončok in :issue:`45413`.)
uk: Коли створюються нові віртуальні середовища Python, *venv* :ref:`sysconfig схема встановлення <installation_paths>` використовується для визначення шляхів усередині середовища. Коли Python працює у віртуальному середовищі, стандартною є та сама схема встановлення. Це означає, що подальші розповсюджувачі можуть змінити схему встановлення sysconfig за умовчанням, не змінюючи поведінку віртуальних середовищ. Код третьої сторони, який також створює нові віртуальні середовища, повинен робити те саме. (Надав Міро Хрончок у :issue:`45413`.)

source: warnings
uk: попередження

source: :func:`warnings.catch_warnings` now accepts arguments for :func:`warnings.simplefilter`, providing a more concise way to locally ignore warnings or convert them to errors. (Contributed by Zac Hatfield-Dodds in :issue:`47074`.)
uk: :func:`warnings.catch_warnings` тепер приймає аргументи для :func:`warnings.simplefilter`, надаючи більш стислий спосіб локально ігнорувати попередження або перетворювати їх на помилки. (Надав Зак Хетфілд-Доддс у :issue:`47074`.)

source: zipfile
uk: zip-файл

source: Added support for specifying member name encoding for reading metadata in the zipfile's directory and file headers. (Contributed by Stephen J. Turnbull and Serhiy Storchaka in :issue:`28080`.)
uk: Додано підтримку визначення кодування імені члена для читання метаданих у каталозі та заголовках файлів zip. (Надано Стівеном Дж. Тернбуллом і Сергієм Сторчакою в :issue:`28080`.)

source: On FreeBSD, the :attr:`F_DUP2FD` and :attr:`F_DUP2FD_CLOEXEC` flags respectively are supported, the former equals to ``dup2`` usage while the latter set the ``FD_CLOEXEC`` flag in addition.
uk: У FreeBSD підтримуються прапорці :attr:`F_DUP2FD` і :attr:`F_DUP2FD_CLOEXEC` відповідно, перший дорівнює використанню ``dup2``, тоді як останній додатково встановлює прапор ``FD_CLOEXEC``.

source: Optimizations
uk: Оптимізації

source: Compiler now optimizes simple C-style formatting with literal format containing only format codes ``%s``, ``%r`` and ``%a`` and makes it as fast as corresponding f-string expression. (Contributed by Serhiy Storchaka in :issue:`28307`.)
uk: Тепер компілятор оптимізує просте форматування у стилі C за допомогою літерального формату, що містить лише коди формату ``%s``, ``%r`` і ``%a``, і робить його таким же швидким, як і відповідний вираз f-рядка. (Надав Сергій Сторчака в :issue:`28307`.)

source: "Zero-cost" exceptions are implemented. The cost of ``try`` statements is almost eliminated when no exception is raised. (Contributed by Mark Shannon in :issue:`40222`.)
uk: Реалізовано винятки "нульової вартості". Вартість інструкцій ``try`` майже зникає, якщо не виникає винятків. (Надав Марк Шеннон у :issue:`40222`.)

source: Pure ASCII strings are now normalized in constant time by :func:`unicodedata.normalize`. (Contributed by Dong-hee Na in :issue:`44987`.)
uk: Чисті рядки ASCII тепер нормалізуються в постійному часі за допомогою :func:`unicodedata.normalize`. (Надав Dong-hee Na у :issue:`44987`.)

source: :mod:`math` functions :func:`~math.comb` and :func:`~math.perm` are now up to 10 times or more faster for large arguments (the speed up is larger for larger *k*). (Contributed by Serhiy Storchaka in :issue:`37295`.)
uk: :mod:`math` функції :func:`~math.comb` і :func:`~math.perm` тепер у 10 або більше разів швидше для великих аргументів (швидкість більша для більших *k*) . (Надав Сергій Сторчака в :issue:`37295`.)

source: Dict don't store hash value when all inserted keys are Unicode objects. This reduces dict size. For example, ``sys.getsizeof(dict.fromkeys("abcdefg"))`` becomes 272 bytes from 352 bytes on 64bit platform. (Contributed by Inada Naoki in :issue:`46845`.)
uk: Dict не зберігає хеш-значення, якщо всі вставлені ключі є об’єктами Unicode. Це зменшує розмір dict. Наприклад, ``sys.getsizeof(dict.fromkeys("abcdefg"))`` стає 272 байтами з 352 байтів на 64-розрядній платформі. (Надано Інадою Наокі в :issue:`46845`.)

source: :mod:`re`'s regular expression matching engine has been partially refactored, and now uses computed gotos (or "threaded code") on supported platforms. As a result, Python 3.11 executes the `pyperformance regular expression benchmarks <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ up to 10% faster than Python 3.10.
uk: Механізм зіставлення регулярних виразів :mod:`re` було частково перероблено, і тепер він використовує обчислені gotos (або "потоковий код") на підтримуваних платформах. Як наслідок, Python 3.11 виконує `тести регулярних виразів pyperformance <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ на 10% швидше, ніж Python 3.10.

source: Faster CPython
uk: Швидший CPython

source: CPython 3.11 is on average `25% faster <https://github.com/faster-cpython/ideas/blob/main/main-vs-310.rst>`_ than CPython 3.10 when measured with the `pyperformance <https://github.com/python/pyperformance>`_ benchmark suite, and compiled with GCC on Ubuntu Linux. Depending on your workload, the speedup could be up to 10-60% faster.
uk: CPython 3.11 у середньому на `25% швидший <https://github.com/faster-cpython/ideas/blob/main/main-vs-310.rst>`_, ніж CPython 3.10, якщо вимірювати за допомогою тестового набору `pyperformance <https://github.com/python/pyperformance>`_ і скомпільовано за допомогою GCC на Ubuntu Linux. Залежно від вашого робочого навантаження прискорення може бути на 10-60% швидшим.

source: This project focuses on two major areas in Python: faster startup and faster runtime. Other optimizations not under this project are listed in `Optimizations`_.
uk: Цей проект зосереджений на двох основних сферах Python: швидшому запуску та швидшому виконанні. Інші оптимізації, які не входять до цього проекту, перераховані в розділі `Optimizations`_.

source: Faster Startup
uk: Швидший запуск

source: Frozen imports / Static code objects
uk: Заморожений імпорт / статичні об’єкти коду

source: Python caches bytecode in the :ref:`__pycache__<tut-pycache>` directory to speed up module loading.
uk: Python кешує байт-код у каталозі :ref:`__pycache__ <tut-pycache>`, щоб пришвидшити завантаження модуля.

source: Previously in 3.10, Python module execution looked like this:
uk: Раніше, у версії 3.10, виконання модуля Python виглядало так:

source: In Python 3.11, the core modules essential for Python startup are "frozen". This means that their code objects (and bytecode) are statically allocated by the interpreter. This reduces the steps in module execution process to this:
uk: У Python 3.11 основні модулі, необхідні для запуску Python, "заморожені". Це означає, що їхні кодові об’єкти (і байт-код) статично виділяються інтерпретатором. Це скорочує кроки в процесі виконання модуля до наступного:

source: Interpreter startup is now 10-15% faster in Python 3.11. This has a big impact for short-running programs using Python.
uk: Запуск інтерпретатора тепер на 10-15% швидший у Python 3.11. Це має великий вплив на короткострокові програми, які використовують Python.

source: (Contributed by Eric Snow, Guido van Rossum and Kumar Aditya in numerous issues.)
uk: (Надано Еріком Сноу, Гвідо ван Россумом і Кумаром Адітією в численних випусках.)

source: Faster Runtime
uk: Швидше виконання

source: Cheaper, lazy Python frames
uk: Дешевші, ліниві фрейми Python

source: Python frames are created whenever Python calls a Python function. This frame holds execution information. The following are new frame optimizations:
uk: Фрейми Python створюються кожного разу, коли Python викликає функцію Python. Цей кадр містить інформацію про виконання. Нижче наведено нові оптимізації кадрів:

source: Streamlined the frame creation process.
uk: Спрощено процес створення кадру.

source: Avoided memory allocation by generously re-using frame space on the C stack.
uk: Уникнення виділення пам’яті шляхом щедрого повторного використання простору кадру в стеку C.

source: Streamlined the internal frame struct to contain only essential information. Frames previously held extra debugging and memory management information.
uk: Спрощена внутрішня структура фрейму, щоб містити лише важливу інформацію. Кадри раніше містили додаткову інформацію для налагодження та керування пам’яттю.

source: Old-style frame objects are now created only when requested by debuggers or by Python introspection functions such as ``sys._getframe`` or ``inspect.currentframe``. For most user code, no frame objects are created at all. As a result, nearly all Python functions calls have sped up significantly. We measured a 3-7% speedup in pyperformance.
uk: Об’єкти рамки старого стилю тепер створюються лише за запитом налагоджувачів або функцій інтроспекції Python, таких як ``sys._getframe`` або ``inspect.currentframe``. Для більшості користувацьких кодів фреймові об’єкти взагалі не створюються. У результаті майже всі виклики функцій Python значно прискорилися. Ми виміряли прискорення pyperformance на 3-7%.

source: (Contributed by Mark Shannon in :issue:`44590`.)
uk: (Надав Марк Шеннон у :issue:`44590`.)

source: Inlined Python function calls
uk: Вбудовані виклики функцій Python

source: During a Python function call, Python will call an evaluating C function to interpret that function's code. This effectively limits pure Python recursion to what's safe for the C stack.
uk: Під час виклику функції Python Python викличе оцінювальну функцію C для інтерпретації коду цієї функції. Це фактично обмежує чисту рекурсію Python тим, що безпечно для стека C.

source: In 3.11, when CPython detects Python code calling another Python function, it sets up a new frame, and "jumps" to the new code inside the new frame. This avoids calling the C interpreting function altogether.
uk: У версії 3.11, коли CPython виявляє код Python, який викликає іншу функцію Python, він встановлює новий фрейм і "переходить" до нового коду в новому фреймі. Це дозволяє повністю уникнути виклику функції інтерпретації C.

source: Most Python function calls now consume no C stack space. This speeds up most of such calls. In simple recursive functions like fibonacci or factorial, a 1.7x speedup was observed. This also means recursive functions can recurse significantly deeper (if the user increases the recursion limit). We measured a 1-3% improvement in pyperformance.
uk: Більшість викликів функцій Python тепер не займають місця в стеку C. Це прискорює більшість таких дзвінків. У простих рекурсивних функціях, таких як фібоначчі або факториал, спостерігалося прискорення в 1,7 раза. Це також означає, що рекурсивні функції можуть рекурсувати значно глибше (якщо користувач збільшить обмеження рекурсії). Ми зафіксували покращення pyperformance на 1-3%.

source: (Contributed by Pablo Galindo and Mark Shannon in :issue:`45256`.)
uk: (Надано Пабло Галіндо та Марком Шенноном у :issue:`45256`.)

source: PEP 659: Specializing Adaptive Interpreter
uk: PEP 659: спеціалізований адаптивний інтерпретатор

source: :pep:`659` is one of the key parts of the faster CPython project. The general idea is that while Python is a dynamic language, most code has regions where objects and types rarely change. This concept is known as *type stability*.
uk: :pep:`659` є однією з ключових частин швидшого проекту CPython. Загальна ідея полягає в тому, що хоча Python є динамічною мовою, більшість коду має області, де об’єкти та типи рідко змінюються. Ця концепція відома як *стабільність типу*.

source: At runtime, Python will try to look for common patterns and type stability in the executing code. Python will then replace the current operation with a more specialized one. This specialized operation uses fast paths available only to those use cases/types, which generally outperform their generic counterparts. This also brings in another concept called *inline caching*, where Python caches the results of expensive operations directly in the bytecode.
uk: Під час виконання Python намагатиметься шукати загальні шаблони та стабільність типів у коді, що виконується. Потім Python замінить поточну операцію на більш спеціалізовану. Ця спеціалізована операція використовує швидкі шляхи, доступні лише для тих випадків/типів використання, які загалом перевершують свої загальні аналоги. Це також привносить іншу концепцію під назвою *вбудоване кешування*, де Python кешує результати дорогих операцій безпосередньо в байт-коді.

source: The specializer will also combine certain common instruction pairs into one superinstruction. This reduces the overhead during execution.
uk: Спеціаліст також поєднає певні загальні пари інструкцій в одну суперінструкцію. Це зменшує накладні витрати під час виконання.

source: Python will only specialize when it sees code that is "hot" (executed multiple times). This prevents Python from wasting time for run-once code. Python can also de-specialize when code is too dynamic or when the use changes. Specialization is attempted periodically, and specialization attempts are not too expensive. This allows specialization to adapt to new circumstances.
uk: Python спеціалізується лише тоді, коли бачить код, який є "гарячим" (виконується кілька разів). Це не дозволяє Python витрачати час на одноразовий код. Python також може деспеціалізуватися, коли код занадто динамічний або коли використання змінюється. Періодично робляться спроби спеціалізації, і спроби спеціалізації не надто дорогі. Це дозволяє спеціалізації адаптуватися до нових обставин.

source: (PEP written by Mark Shannon, with ideas inspired by Stefan Brunthaler. See :pep:`659` for more information. Implementation by Mark Shannon and Brandt Bucher, with additional help from Irit Katriel and Dennis Sweeney.)
uk: (PEP, написаний Марком Шенноном, з ідеями, натхненними Стефаном Брунталером. Див. :pep:`659` для отримання додаткової інформації. Реалізація Марком Шенноном і Брандтом Бухером за додаткової допомоги Іріт Катріель і Денніса Суїні.)

source: Operation
uk: Операція

source: Form
uk: Форма

source: Specialization
uk: Спеціалізація

source: Operation speedup (up to)
uk: Прискорення роботи (до)

source: Contributor(s)
uk: Автор(и)

source: Binary operations
uk: Бінарні операції

source: ``x+x; x*x; x-x;``
uk: ``x+x; х*х; x-x;``

source: Binary add, multiply and subtract for common types such as ``int``, ``float``, and ``str`` take custom fast paths for their underlying types.
uk: Двійкове додавання, множення та віднімання для поширених типів, таких як ``int``, ``float`` і ``str``, використовують власні швидкі шляхи для своїх основних типів.

source: Mark Shannon, Dong-hee Na, Brandt Bucher, Dennis Sweeney
uk: Марк Шеннон, Дон Хі На, Брандт Бухер, Денніс Суїні

source: Subscript
uk: Підрядковий

source: Subscripting container types such as ``list``, ``tuple`` and ``dict`` directly index the underlying data structures.
uk: Підрядкові типи контейнерів, такі як ``list``, ``tuple`` і ``dict``, безпосередньо індексують базові структури даних.

source: Subscripting custom ``__getitem__`` is also inlined similar to :ref:`inline-calls`.
uk: Підписка спеціального ``__getitem__`` також вбудована подібно до :ref:`inline-calls`.

source: Irit Katriel, Mark Shannon
uk: Ірит Катріель, Марк Шеннон

source: Store subscript
uk: Підрядковий магазин

source: Similar to subscripting specialization above.
uk: Подібно до спеціалізації підписки вище.

source: Dennis Sweeney
uk: Денніс Суїні

source: Calls
uk: Дзвінки

source: Calls to common builtin (C) functions and types such as ``len`` and ``str`` directly call their underlying C version. This avoids going through the internal calling convention.
uk: Виклики загальних вбудованих (C) функцій і типів, таких як ``len`` і ``str``, безпосередньо викликають їх базову версію C. Це дозволяє уникнути використання внутрішньої угоди про виклики.

source: Mark Shannon, Ken Jin
uk: Марк Шеннон, Кен Джин

source: Load global variable
uk: Завантажити глобальну змінну

source: The object's index in the globals/builtins namespace is cached. Loading globals and builtins require zero namespace lookups.
uk: Індекс об’єкта в просторі імен globals/builtins кешується. Завантаження глобальних і вбудованих елементів не вимагає пошуку простору імен.

source: Mark Shannon
uk: Марк Шеннон

source: Load attribute
uk: Завантажити атрибут

source: Similar to loading global variables. The attribute's index inside the class/object's namespace is cached. In most cases, attribute loading will require zero namespace lookups.
uk: Подібно до завантаження глобальних змінних. Індекс атрибута в просторі імен класу/об’єкта кешується. У більшості випадків завантаження атрибутів не потребуватиме пошуку простору імен.

source: Load methods for call
uk: Завантажити методи для виклику

source: The actual address of the method is cached. Method loading now has no namespace lookups -- even for classes with long inheritance chains.
uk: Справжня адреса методу кешується. Завантаження методів тепер не має пошуку простору імен — навіть для класів із довгими ланцюжками успадкування.

source: Ken Jin, Mark Shannon
uk: Кен Джин, Марк Шеннон

source: Store attribute
uk: Атрибут магазину

source: Similar to load attribute optimization.
uk: Подібно до оптимізації атрибутів завантаження.

source: 2% in pyperformance
uk: 2% у pyperformance

source: Unpack Sequence
uk: Розпакуйте послідовність

source: Specialized for common containers such as ``list`` and ``tuple``. Avoids internal calling convention.
uk: Спеціалізується на звичайних контейнерах, таких як ``список`` і ``кортеж``. Уникає внутрішньої угоди про виклики.

source: Brandt Bucher
uk: Брандт Бухер

source: A similar optimization already existed since Python 3.8. 3.11 specializes for more forms and reduces some overhead.
uk: Подібна оптимізація вже існувала з Python 3.8. 3.11 спеціалізується на більшій кількості форм і зменшує деякі накладні витрати.

source: A similar optimization already existed since Python 3.10. 3.11 specializes for more forms. Furthermore, all attribute loads should be sped up by :issue:`45947`.
uk: Подібна оптимізація вже існувала з Python 3.10. 3.11 спеціалізується на більшій кількості форм. Крім того, усі завантаження атрибутів мають бути прискорені на :issue:`45947`.

source: Misc
uk: Різне

source: Objects now require less memory due to lazily created object namespaces. Their namespace dictionaries now also share keys more freely. (Contributed Mark Shannon in :issue:`45340` and :issue:`40116`.)
uk: Тепер об’єкти вимагають менше пам’яті через ліниво створювані простори імен об’єктів. Їхні словники простору імен тепер також вільніше обмінюються ключами. (Надав Марк Шеннон у :issue:`45340` і :issue:`40116`.)

source: A more concise representation of exceptions in the interpreter reduced the time required for catching an exception by about 10%. (Contributed by Irit Katriel in :issue:`45711`.)
uk: Більш стисле представлення винятків в інтерпретаторі скоротило час, необхідний для перехоплення винятку, приблизно на 10%. (Надано Іріт Катріель у :issue:`45711`.)

source: Q: How should I write my code to utilize these speedups?
uk: З: Як мені написати свій код, щоб використовувати ці прискорення?

source: A: You don't have to change your code. Write Pythonic code that follows common best practices. The Faster CPython project optimizes for common code patterns we observe.
uk: A: Вам не потрібно змінювати свій код. Напишіть код Pythonic, який дотримується загальних найкращих практик. Проект Faster CPython оптимізує загальні шаблони коду, які ми спостерігаємо.

source: Q: Will CPython 3.11 use more memory?
uk: З: Чи використовуватиме CPython 3.11 більше пам’яті?

source: A: Maybe not. We don't expect memory use to exceed 20% more than 3.10. This is offset by memory optimizations for frame objects and object dictionaries as mentioned above.
uk: A: Можливо, ні. Ми не очікуємо, що використання пам’яті перевищить 20% більше, ніж 3.10. Це компенсується оптимізацією пам’яті для об’єктів фрейму та словників об’єктів, як зазначено вище.

source: Q: I don't see any speedups in my workload. Why?
uk: З: Я не бачу прискорення свого робочого навантаження. чому

source: A: Certain code won't have noticeable benefits. If your code spends most of its time on I/O operations, or already does most of its computation in a C extension library like numpy, there won't be significant speedup. This project currently benefits pure-Python workloads the most.
uk: A: Певний код не матиме помітних переваг. Якщо ваш код витрачає більшу частину свого часу на операції введення-виведення або вже виконує більшу частину своїх обчислень у бібліотеці розширення C, як-от numpy, значного прискорення не буде. Зараз цей проект найбільше приносить користь робочим навантаженням на чистому Python.

source: Furthermore, the pyperformance figures are a geometric mean. Even within the pyperformance benchmarks, certain benchmarks have slowed down slightly, while others have sped up by nearly 2x!
uk: Крім того, показники pyperformance є середнім геометричним. Навіть у тестах pyperformance деякі тести трохи сповільнилися, тоді як інші прискорилися майже вдвічі!

source: Q: Is there a JIT compiler?
uk: Q: Чи існує JIT-компілятор?

source: A: No. We're still exploring other optimizations.
uk: A: Ні. Ми все ще вивчаємо інші оптимізації.

source: About
uk: про
