Repository: andriisoldatenko/python-docs-uk
Catalog: whatsnew/3.11.po
Languages: uk

source: The :c:type:`PyFrameObject` structure members have been removed from the public C API.
uk: Члени структури :c:type:`PyFrameObject` видалено з загальнодоступного C API.

source: While the documentation notes that the :c:type:`PyFrameObject` fields are subject to change at any time, they have been stable for a long time and were used in several popular extensions.
uk: Хоча в документації зазначено, що поля :c:type:`PyFrameObject` можуть бути змінені в будь-який час, вони були стабільними протягом тривалого часу та використовувалися в кількох популярних розширеннях.

source: In Python 3.11, the frame struct was reorganized to allow performance optimizations. Some fields were removed entirely, as they were details of the old implementation.
uk: У Python 3.11 структуру фрейму було реорганізовано для оптимізації продуктивності. Деякі поля було повністю видалено, оскільки вони були деталями старої реалізації.

source: :c:type:`PyFrameObject` fields:
uk: :c:type:`PyFrameObject` поля:

source: ``f_back``: use :c:func:`PyFrame_GetBack`.
uk: ``f_back``: використовуйте :c:func:`PyFrame_GetBack`.

source: ``f_blockstack``: removed.
uk: ``f_blockstack``: видалено.

source: ``f_builtins``: use :c:func:`PyFrame_GetBuiltins`.
uk: ``f_builtins``: використовуйте :c:func:`PyFrame_GetBuiltins`.

source: ``f_code``: use :c:func:`PyFrame_GetCode`.
uk: ``f_code``: використовуйте :c:func:`PyFrame_GetCode`.

source: ``f_gen``: use :c:func:`PyFrame_GetGenerator`.
uk: ``f_gen``: використовуйте :c:func:`PyFrame_GetGenerator`.

source: ``f_globals``: use :c:func:`PyFrame_GetGlobals`.
uk: ``f_globals``: використовуйте :c:func:`PyFrame_GetGlobals`.

source: ``f_iblock``: removed.
uk: ``f_iblock``: видалено.

source: ``f_lasti``: use :c:func:`PyFrame_GetLasti`. Code using ``f_lasti`` with ``PyCode_Addr2Line()`` should use :c:func:`PyFrame_GetLineNumber` instead; it may be faster.
uk: ``f_lasti``: використовуйте :c:func:`PyFrame_GetLasti`. У коді, що використовує ``f_lasti`` з ``PyCode_Addr2Line()``, замість цього слід використовувати :c:func:`PyFrame_GetLineNumber`; це може бути швидше.

source: ``f_lineno``: use :c:func:`PyFrame_GetLineNumber`
uk: ``f_lineno``: використовуйте :c:func:`PyFrame_GetLineNumber`

source: ``f_locals``: use :c:func:`PyFrame_GetLocals`.
uk: ``f_locals``: використовуйте :c:func:`PyFrame_GetLocals`.

source: ``f_stackdepth``: removed.
uk: ``f_stackdepth``: видалено.

source: ``f_state``: no public API (renamed to ``f_frame.f_state``).
uk: ``f_state``: немає публічного API (перейменовано на ``f_frame.f_state``).

source: ``f_trace``: no public API.
uk: ``f_trace``: немає публічного API.

source: ``f_trace_lines``: use ``PyObject_GetAttrString((PyObject*)frame, "f_trace_lines")``.
uk: ``f_trace_lines``: використовуйте ``PyObject_GetAttrString((PyObject*)frame, "f_trace_lines")``.

source: ``f_trace_opcodes``: use ``PyObject_GetAttrString((PyObject*)frame, "f_trace_opcodes")``.
uk: ``f_trace_opcodes``: використовуйте ``PyObject_GetAttrString((PyObject*)frame, "f_trace_opcodes")``.

source: ``f_localsplus``: no public API (renamed to ``f_frame.localsplus``).
uk: ``f_localsplus``: немає публічного API (перейменовано на ``f_frame.localsplus``).

source: ``f_valuestack``: removed.
uk: ``f_valuestack``: видалено.

source: The Python frame object is now created lazily. A side effect is that the ``f_back`` member must not be accessed directly, since its value is now also computed lazily. The :c:func:`PyFrame_GetBack` function must be called instead.
uk: Об’єкт рамки Python тепер створюється ліниво. Побічним ефектом є те, що до члена ``f_back`` не можна звертатися безпосередньо, оскільки його значення тепер також обчислюється ліниво. Натомість слід викликати функцію :c:func:`PyFrame_GetBack`.

source: Debuggers that accessed the ``f_locals`` directly *must* call :c:func:`PyFrame_GetLocals` instead. They no longer need to call :c:func:`PyFrame_FastToLocalsWithError` or :c:func:`PyFrame_LocalsToFast`, in fact they should not call those functions. The necessary updating of the frame is now managed by the virtual machine.
uk: Налагоджувачі, які зверталися безпосередньо до ``f_locals``, *повинні* замість цього викликати :c:func:`PyFrame_GetLocals`. Їм більше не потрібно викликати :c:func:`PyFrame_FastToLocalsWithError` або :c:func:`PyFrame_LocalsToFast`, насправді вони не повинні викликати ці функції. Необхідне оновлення кадру тепер керується віртуальною машиною.

source: Code defining ``PyFrame_GetCode()`` on Python 3.8 and older::
uk: Код визначення ``PyFrame_GetCode()`` на Python 3.8 і старіших версіях::

source: Code defining ``PyFrame_GetBack()`` on Python 3.8 and older::
uk: Код визначення ``PyFrame_GetBack()`` на Python 3.8 і старіших версіях::

source: Or use the `pythoncapi_compat project <https://github.com/python/pythoncapi_compat>`__ to get these two functions on older Python versions.
uk: Або скористайтеся проектом `pythoncapi_compat <https://github.com/python/pythoncapi_compat>`__, щоб отримати ці дві функції на старіших версіях Python.

source: Changes of the :c:type:`PyThreadState` structure members:
uk: Зміни членів структури :c:type:`PyThreadState`:

source: ``frame``: removed, use :c:func:`PyThreadState_GetFrame` (function added to Python 3.9 by :issue:`40429`). Warning: the function returns a :term:`strong reference`, need to call :c:func:`Py_XDECREF`.
uk: ``frame``: видалено, використовуйте :c:func:`PyThreadState_GetFrame` (функцію додано до Python 3.9 :issue:`40429`). Попередження: функція повертає :term:`strong reference`, потрібно викликати :c:func:`Py_XDECREF`.

source: ``tracing``: changed, use :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` (functions added to Python 3.11 by :issue:`43760`).
uk: ``tracing``: змінено, використовуйте :c:func:`PyThreadState_EnterTracing` і :c:func:`PyThreadState_LeaveTracing` (функції, додані до Python 3.11 :issue:`43760`).

source: ``recursion_depth``: removed, use ``(tstate->recursion_limit - tstate->recursion_remaining)`` instead.
uk: ``recursion_depth``: видалено, замість цього використовуйте ``(tstate->recursion_limit - tstate->recursion_remaining)``.

source: ``stackcheck_counter``: removed.
uk: ``stackcheck_counter``: видалено.

source: Code defining ``PyThreadState_GetFrame()`` on Python 3.8 and older::
uk: Код визначення ``PyThreadState_GetFrame()`` на Python 3.8 і старіших версіях::

source: Code defining ``PyThreadState_EnterTracing()`` and ``PyThreadState_LeaveTracing()`` on Python 3.10 and older::
uk: Код, що визначає ``PyThreadState_EnterTracing()`` і ``PyThreadState_LeaveTracing()`` на Python 3.10 і старіших версіях::

source: Or use `the pythoncapi_compat project <https://github.com/python/pythoncapi_compat>`__ to get these functions on old Python functions.
uk: Або використовуйте `проект pythoncapi_compat <https://github.com/python/pythoncapi_compat>`__, щоб отримати ці функції на старих функціях Python.

source: Distributors are encouraged to build Python with the optimized Blake2 library `libb2`_.
uk: Розповсюджувачам рекомендується створювати Python за допомогою оптимізованої бібліотеки Blake2 `libb2`_.

source: :c:func:`PyConfig_Read` no longer calculates the initial search path, and will not fill any values into :c:member:`PyConfig.module_search_paths`. To calculate default paths and then modify them, finish initialization and use :c:func:`PySys_GetObject` to retrieve :data:`sys.path` as a Python list object and modify it directly.
uk: :c:func:`PyConfig_Read` більше не обчислює початковий шлях пошуку та не заповнює жодних значень у :c:member:`PyConfig.module_search_paths`. Щоб обчислити шляхи за замовчуванням і потім змінити їх, завершіть ініціалізацію та використовуйте :c:func:`PySys_GetObject`, щоб отримати :data:`sys.path` як об’єкт списку Python і змінити його безпосередньо.

source: Deprecate the following functions to configure the Python initialization:
uk: Застарілі такі функції для налаштування ініціалізації Python:

source: Use the new :c:type:`PyConfig` API of the :ref:`Python Initialization Configuration <init-config>` instead (:pep:`587`). (Contributed by Victor Stinner in :gh:`88279`.)
uk: Замість цього використовуйте новий :c:type:`PyConfig` API :ref:`Конфігурації ініціалізації Python <init-config>` (:pep:`587`). (Надав Віктор Стіннер у :gh:`88279`.)

source: Deprecate the ``ob_shash`` member of the :c:type:`PyBytesObject`. Use :c:func:`PyObject_Hash` instead. (Contributed by Inada Naoki in :issue:`46864`.)
uk: Застарілий член ``ob_shash`` :c:type:`PyBytesObject`. Натомість використовуйте :c:func:`PyObject_Hash`. (Надано Інадою Наокі в :issue:`46864`.)

source: :c:func:`PyFrame_BlockSetup` and :c:func:`PyFrame_BlockPop` have been removed. (Contributed by Mark Shannon in :issue:`40222`.)
uk: :c:func:`PyFrame_BlockSetup` і :c:func:`PyFrame_BlockPop` видалено. (Надав Марк Шеннон у :issue:`40222`.)

source: Remove the following math macros using the ``errno`` variable:
uk: Видаліть наступні математичні макроси за допомогою змінної ``errno``:

source: (Contributed by Victor Stinner in :issue:`45412`.)
uk: (Надав Віктор Стіннер у :issue:`45412`.)

source: Remove ``Py_UNICODE_COPY()`` and ``Py_UNICODE_FILL()`` macros, deprecated since Python 3.3. Use ``PyUnicode_CopyCharacters()`` or ``memcpy()`` (``wchar_t*`` string), and ``PyUnicode_Fill()`` functions instead. (Contributed by Victor Stinner in :issue:`41123`.)
uk: Видаліть макроси ``Py_UNICODE_COPY()`` і ``Py_UNICODE_FILL()``, застарілі з Python 3.3. Замість цього використовуйте функції ``PyUnicode_CopyCharacters()`` або ``memcpy()`` (рядок ``wchar_t*``) і ``PyUnicode_Fill()``. (Надав Віктор Стіннер у :issue:`41123`.)

source: Remove the ``pystrhex.h`` header file. It only contains private functions. C extensions should only include the main ``<Python.h>`` header file. (Contributed by Victor Stinner in :issue:`45434`.)
uk: Видаліть файл заголовка ``pystrhex.h``. Він містить лише приватні функції. Розширення C мають включати лише основний файл заголовка ``<Python.h>``. (Надав Віктор Стіннер у :issue:`45434`.)

source: Remove the ``Py_FORCE_DOUBLE()`` macro. It was used by the ``Py_IS_INFINITY()`` macro. (Contributed by Victor Stinner in :issue:`45440`.)
uk: Видаліть макрос ``Py_FORCE_DOUBLE()``. Його використовував макрос ``Py_IS_INFINITY()``. (Надав Віктор Стіннер у :issue:`45440`.)

source: The following items are no longer available when :c:macro:`Py_LIMITED_API` is defined:
uk: Наступні елементи більше не доступні, коли визначено :c:macro:`Py_LIMITED_API`:

source: the ``Py_MARSHAL_VERSION`` macro
uk: макрос ``Py_MARSHAL_VERSION``

source: These are not part of the :ref:`limited API <stable-abi-list>`.
uk: Вони не є частиною :ref:`обмеженого API <stable-abi-list>`.

source: (Contributed by Victor Stinner in :issue:`45474`.)
uk: (Надав Віктор Стіннер у :issue:`45474`.)

source: Exclude :c:func:`PyWeakref_GET_OBJECT` from the limited C API. It never worked since the :c:type:`PyWeakReference` structure is opaque in the limited C API. (Contributed by Victor Stinner in :issue:`35134`.)
uk: Виключіть :c:func:`PyWeakref_GET_OBJECT` з обмеженого C API. Це ніколи не працювало, оскільки структура :c:type:`PyWeakReference` непрозора в обмеженому C API. (Надав Віктор Стіннер у :issue:`35134`.)

source: Remove the ``PyHeapType_GET_MEMBERS()`` macro. It was exposed in the public C API by mistake, it must only be used by Python internally. Use the ``PyTypeObject.tp_members`` member instead. (Contributed by Victor Stinner in :issue:`40170`.)
uk: Видаліть макрос ``PyHeapType_GET_MEMBERS()``. Він був відкритий у загальнодоступному C API помилково, він повинен використовуватися лише внутрішньо Python. Натомість використовуйте член ``PyTypeObject.tp_members``. (Надав Віктор Стіннер у :issue:`40170`.)

source: Remove the ``HAVE_PY_SET_53BIT_PRECISION`` macro (moved to the internal C API). (Contributed by Victor Stinner in :issue:`45412`.)
uk: Видаліть макрос ``HAVE_PY_SET_53BIT_PRECISION`` (перенесено до внутрішнього API C). (Надав Віктор Стіннер у :issue:`45412`.)
