Repository: andriisoldatenko/python-docs-uk
Catalog: whatsnew/3.11.po
Languages: uk

source: :func:`open`, :func:`io.open`, :func:`codecs.open` and :class:`fileinput.FileInput` no longer accept ``'U'`` ("universal newline") in the file mode. This flag was deprecated since Python 3.3. In Python 3, the "universal newline" is used by default when a file is open in text mode. The :ref:`newline parameter <open-newline-parameter>` of :func:`open` controls how universal newlines works. (Contributed by Victor Stinner in :issue:`37330`.)
uk: :func:`open`, :func:`io.open`, :func:`codecs.open` і :class:`fileinput.FileInput` більше не приймають ``'U'`` ("універсальний новий рядок") у файловий режим. Цей прапорець застарів з Python 3.3. У Python 3 "універсальний новий рядок" використовується за замовчуванням, коли файл відкрито в текстовому режимі. Параметр :ref:`newline <open-newline-parameter>` :func:`open` контролює роботу універсальних символів нового рядка. (Надав Віктор Стіннер у :issue:`37330`.)

source: The :mod:`pdb` module now reads the :file:`.pdbrc` configuration file with the ``'utf-8'`` encoding. (Contributed by Srinivas Reddy Thatiparthy (శ్రీనివాస్ రెడ్డి తాటిపర్తి) in :issue:`41137`.)
uk: Модуль :mod:`pdb` тепер читає файл конфігурації :file:`.pdbrc` із кодуванням ``'utf-8'``. (Надав Срінівас Редді Татіпарті (శ్రీనివాస్ రెడ్డి తాటిపర్తి) у :issue:`41137`.)

source: When sorting using tuples as keys, the order of the result may differ from earlier releases if the tuple elements don't define a total ordering (see :ref:`expressions-value-comparisons` for information on total ordering). It's generally true that the result of sorting simply isn't well-defined in the absence of a total ordering on list elements.
uk: Під час сортування за допомогою кортежів як ключів порядок результатів може відрізнятися від попередніх випусків, якщо елементи кортежу не визначають загальне впорядкування (перегляньте :ref:`expressions-value-comparisons` для інформації про загальне впорядкування). Загалом вірно, що результат сортування просто не є чітко визначеним за відсутності загального впорядкування елементів списку.

source: :mod:`calendar`: The :class:`calendar.LocaleTextCalendar` and :class:`calendar.LocaleHTMLCalendar` classes now use :func:`locale.getlocale`, instead of using :func:`locale.getdefaultlocale`, if no locale is specified. (Contributed by Victor Stinner in :issue:`46659`.)
uk: :mod:`calendar`: класи :class:`calendar.LocaleTextCalendar` і :class:`calendar.LocaleHTMLCalendar` тепер використовують :func:`locale.getlocale` замість використання :func:`locale.getdefaultlocale`, якщо не вказано мову. (Надав Віктор Стіннер у :issue:`46659`.)

source: Global inline flags (e.g. ``(?i)``) can now only be used at the start of the regular expressions. Using them not at the start of expression was deprecated since Python 3.6. (Contributed by Serhiy Storchaka in :issue:`47066`.)
uk: Глобальні вбудовані прапорці (наприклад, ``(?i)`` тепер можна використовувати лише на початку регулярних виразів. Використання їх не на початку виразу застаріло з Python 3.6. (Надав Сергій Сторчака в :issue:`47066`.)

source: :mod:`re` module: Fix a few long-standing bugs where, in rare cases, capturing group could get wrong result. So the result may be different than before. (Contributed by Ma Lin in :issue:`35859`.)
uk: Модуль :mod:`re`: виправлено кілька давніх помилок, через які, у рідкісних випадках, група захоплення могла отримати неправильний результат. Тому результат може бути іншим, ніж раніше. (Надав Ма Лінь у :issue:`35859`.)

source: The *population* parameter of :func:`random.sample` must be a sequence. Automatic conversion of sets to lists is no longer supported. If the sample size is larger than the population size, a :exc:`ValueError` is raised. (Contributed by Raymond Hettinger in :issue:`40465`.)
uk: Параметр *population* :func:`random.sample` має бути послідовністю. Автоматичне перетворення наборів у списки більше не підтримується. Якщо розмір вибірки більший за розмір сукупності, виникає помилка :exc:`ValueError`. (Надав Реймонд Геттінгер у :issue:`40465`.)

source: Build Changes
uk: Зміни збірки

source: Building Python now requires a C11 compiler without optional C11 features. (Contributed by Victor Stinner in :issue:`46656`.)
uk: Для створення Python тепер потрібен компілятор C11 без додаткових функцій C11. (Надав Віктор Стіннер у :issue:`46656`.)

source: Building Python now requires support of IEEE 754 floating point numbers. (Contributed by Victor Stinner in :issue:`46917`.)
uk: Для створення Python тепер потрібна підтримка чисел з плаваючою комою IEEE 754. (Надав Віктор Стіннер у :issue:`46917`.)

source: CPython can now be built with the ThinLTO option via ``--with-lto=thin``. (Contributed by Dong-hee Na and Brett Holman in :issue:`44340`.)
uk: Тепер CPython можна створювати з опцією ThinLTO через ``--with-lto=thin``. (Надано Dong-hee Na та Brett Holman у :issue:`44340`.)

source: libpython is no longer linked against libcrypt. (Contributed by Mike Gilbert in :issue:`45433`.)
uk: libpython більше не пов’язано з libcrypt. (Надав Майк Гілберт у :issue:`45433`.)

source: Building Python now requires a C99 ``<math.h>`` header file providing the following functions: ``copysign()``, ``hypot()``, ``isfinite()``, ``isinf()``, ``isnan()``, ``round()``. (Contributed by Victor Stinner in :issue:`45440`.)
uk: Тепер для збирання Python потрібен файл заголовка C99 ``<math.h>``, який забезпечує такі функції: ``copysign()``, ``hypot()``, ``isfinite()``, ``isinf()``, ``isnan()``, ``round()``. (Надав Віктор Стіннер у :issue:`45440`.)

source: Building Python now requires a C99 ``<math.h>`` header file providing a ``NAN`` constant, or the ``__builtin_nan()`` built-in function. (Contributed by Victor Stinner in :issue:`46640`.)
uk: Тепер для збирання Python потрібен файл заголовка C99 ``<math.h>``, що містить константу ``NAN``, або вбудована функція ``__builtin_nan()``. (Надав Віктор Стіннер у :issue:`46640`.)

source: Building Python now requires support for floating point Not-a-Number (NaN): remove the ``Py_NO_NAN`` macro. (Contributed by Victor Stinner in :issue:`46656`.)
uk: Тепер для створення Python потрібна підтримка Not-a-Number (NaN) з плаваючою комою: видаліть макрос ``Py_NO_NAN``. (Надав Віктор Стіннер у :issue:`46656`.)

source: Freelists for object structs can now be disabled. A new :program:`configure` option :option:`!--without-freelists` can be used to disable all freelists except empty tuple singleton. (Contributed by Christian Heimes in :issue:`45522`)
uk: Вільні списки для структур об’єктів тепер можна вимкнути. Новий параметр :program:`configure` :option:`!--without-freelists` можна використовувати для вимкнення всіх списків безкоштовних, окрім пустого одиночного кортежу. (Надав Крістіан Хеймс у :issue:`45522`)

source: ``Modules/Setup`` and ``Modules/makesetup`` have been improved and tied up. Extension modules can now be built through ``makesetup``. All except some test modules can be linked statically into main binary or library. (Contributed by Brett Cannon and Christian Heimes in :issue:`45548`, :issue:`45570`, :issue:`45571`, and :issue:`43974`.)
uk: ``Modules/Setup`` і ``Modules/makesetup`` були покращені та пов’язані. Модулі розширення тепер можна створювати за допомогою ``makesetup``. Усі тестові модулі, окрім деяких, можна зв’язати статично в головний двійковий файл або бібліотеку. (Надано Бреттом Кенноном і Крістіаном Хеймсом у :issue:`45548`, :issue:`45570`, :issue:`45571` і :issue:`43974`.)

source: Build dependencies, compiler flags, and linker flags for most stdlib extension modules are now detected by :program:`configure`. libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk libs, and uuid flags are detected by ``pkg-config`` (when available). (Contributed by Christian Heimes and Erlend Egeberg Aasland in :issue:`45847`, :issue:`45747`, and :issue:`45763`.)
uk: Залежності збірки, прапорці компілятора та прапорці компонувальника для більшості модулів розширення stdlib тепер визначаються :program:`configure`. Прапори libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk libs і uuid визначаються ``pkg-config`` (якщо доступно). (Надано Крістіаном Хеймсом та Ерлендом Егебергом Асландом у :issue:`45847`, :issue:`45747` та :issue:`45763`.)

source: Use the environment variables ``TCLTK_CFLAGS`` and ``TCLTK_LIBS`` to manually specify the location of Tcl/Tk headers and libraries. The :program:`configure` options ``--with-tcltk-includes`` and ``--with-tcltk-libs`` have been removed.
uk: Використовуйте змінні середовища ``TCLTK_CFLAGS`` і ``TCLTK_LIBS``, щоб вручну вказати розташування заголовків і бібліотек Tcl/Tk. Параметри :program:`configure` ``--with-tcltk-includes`` і ``--with-tcltk-libs`` видалено.

source: CPython now has experimental support for cross compiling to WebAssembly platform ``wasm32-emscripten``. The effort is inspired by previous work like Pyodide. (Contributed by Christian Heimes and Ethan Smith in :issue:`40280`.)
uk: CPython тепер має експериментальну підтримку крос-компіляції на платформі WebAssembly ``wasm32-emscripten``. Зусилля надихнули попередні роботи, такі як Pyodide. (Надано Крістіаном Хеймсом та Ітаном Смітом у :issue:`40280`.)

source: CPython will now use 30-bit digits by default for the Python :class:`int` implementation. Previously, the default was to use 30-bit digits on platforms with ``SIZEOF_VOID_P >= 8``, and 15-bit digits otherwise. It's still possible to explicitly request use of 15-bit digits via either the ``--enable-big-digits`` option to the configure script or (for Windows) the ``PYLONG_BITS_IN_DIGIT`` variable in ``PC/pyconfig.h``, but this option may be removed at some point in the future. (Contributed by Mark Dickinson in :issue:`45569`.)
uk: CPython тепер використовуватиме 30-бітні цифри за замовчуванням для реалізації Python :class:`int`. Раніше за замовчуванням використовувалися 30-бітні цифри на платформах із ``SIZEOF_VOID_P >= 8``, а в інших випадках – 15-бітні цифри. Все ще можна явно надіслати запит на використання 15-бітних цифр за допомогою опції ``--enable-big-digits`` сценарію налаштування або (для Windows) змінної ``PYLONG_BITS_IN_DIGIT`` у ``PC/pyconfig. h``, але цей параметр може бути видалено в якийсь момент у майбутньому. (Надав Марк Дікінсон у :issue:`45569`.)

source: The :mod:`tkinter` package now requires Tcl/Tk version 8.5.12 or newer. (Contributed by Serhiy Storchaka in :issue:`46996`.)
uk: Для пакета :mod:`tkinter` тепер потрібен Tcl/Tk версії 8.5.12 або новішої. (Надав Сергій Сторчака в :issue:`46996`.)

source: C API Changes
uk: Зміни C API

source: Add a new :c:func:`PyType_GetName` function to get type's short name. (Contributed by Hai Shi in :issue:`42035`.)
uk: Додайте нову функцію :c:func:`PyType_GetName`, щоб отримати коротку назву типу. (Надав Хай Ши в :issue:`42035`.)

source: Add a new :c:func:`PyType_GetQualName` function to get type's qualified name. (Contributed by Hai Shi in :issue:`42035`.)
uk: Додайте нову функцію :c:func:`PyType_GetQualName`, щоб отримати кваліфіковане ім’я типу. (Надав Хай Ши в :issue:`42035`.)

source: Add new :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` functions to the limited C API to suspend and resume tracing and profiling. (Contributed by Victor Stinner in :issue:`43760`.)
uk: Додайте нові функції :c:func:`PyThreadState_EnterTracing` і :c:func:`PyThreadState_LeaveTracing` до обмеженого C API, щоб призупиняти та відновлювати трасування та профілювання. (Надав Віктор Стіннер у :issue:`43760`.)

source: Added the :c:data:`Py_Version` constant which bears the same value as :c:macro:`PY_VERSION_HEX`. (Contributed by Gabriele N. Tornetta in :issue:`43931`.)
uk: Додано константу :c:data:`Py_Version`, яка має те саме значення, що й :c:macro:`PY_VERSION_HEX`. (Надано Gabriele N. Tornetta в :issue:`43931`.)

source: :c:type:`Py_buffer` and APIs are now part of the limited API and the stable ABI:
uk: :c:type:`Py_buffer` та API тепер є частиною обмеженого API та стабільного ABI:

source: :c:member:`~PyBufferProcs.bf_getbuffer` and :c:member:`~PyBufferProcs.bf_releasebuffer` type slots
uk: :c:member:`~PyBufferProcs.bf_getbuffer` і :c:member:`~PyBufferProcs.bf_releasebuffer` слоти типу

source: (Contributed by Christian Heimes in :issue:`45459`.)
uk: (Надав Крістіан Хеймс у :issue:`45459`.)

source: Added the :c:data:`PyType_GetModuleByDef` function, used to get the module in which a method was defined, in cases where this information is not available directly (via :c:type:`PyCMethod`). (Contributed by Petr Viktorin in :issue:`46613`.)
uk: Додано функцію :c:data:`PyType_GetModuleByDef`, яка використовується для отримання модуля, у якому було визначено метод, у випадках, коли ця інформація недоступна безпосередньо (через :c:type:`PyCMethod`). (Надав Петро Вікторін у :issue:`46613`.)

source: Add new functions to pack and unpack C double (serialize and deserialize): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2`, :c:func:`PyFloat_Unpack4` and :c:func:`PyFloat_Unpack8`. (Contributed by Victor Stinner in :issue:`46906`.)
uk: Додайте нові функції для пакування та розпакування C double (серіалізація та десеріалізація): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2` , :c:func:`PyFloat_Unpack4` і :c:func:`PyFloat_Unpack8`. (Надав Віктор Стіннер у :issue:`46906`.)

source: Add new functions to get frame object attributes: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.
uk: Додайте нові функції для отримання атрибутів об’єкта фрейму: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.

source: Added two new functions to get and set the active exception instance: :c:func:`PyErr_GetHandledException` and :c:func:`PyErr_SetHandledException`. These are alternatives to :c:func:`PyErr_SetExcInfo()` and :c:func:`PyErr_GetExcInfo()` which work with the legacy 3-tuple representation of exceptions. (Contributed by Irit Katriel in :issue:`46343`.)
uk: Додано дві нові функції для отримання та встановлення активного екземпляра винятку: :c:func:`PyErr_GetHandledException` і :c:func:`PyErr_SetHandledException`. Це альтернативи :c:func:`PyErr_SetExcInfo()` і :c:func:`PyErr_GetExcInfo()`, які працюють із застарілим 3-кортежним представленням винятків. (Надано Іріт Катріель у :issue:`46343`.)

source: Added the :c:member:`PyConfig.safe_path` member. (Contributed by Victor Stinner in :gh:`57684`.)
uk: Додано член :c:member:`PyConfig.safe_path`. (Надав Віктор Стіннер у :gh:`57684`.)

source: :c:func:`PyErr_SetExcInfo()` no longer uses the ``type`` and ``traceback`` arguments, the interpreter now derives those values from the exception instance (the ``value`` argument). The function still steals references of all three arguments. (Contributed by Irit Katriel in :issue:`45711`.)
uk: :c:func:`PyErr_SetExcInfo()` більше не використовує аргументи ``type`` і ``traceback``, тепер інтерпретатор отримує ці значення з екземпляра винятку (аргумент ``value``). Функція все ще викрадає посилання всіх трьох аргументів. (Надано Іріт Катріель у :issue:`45711`.)

source: :c:func:`PyErr_GetExcInfo()` now derives the ``type`` and ``traceback`` fields of the result from the exception instance (the ``value`` field). (Contributed by Irit Katriel in :issue:`45711`.)
uk: :c:func:`PyErr_GetExcInfo()` тепер отримує поля ``type`` і ``traceback`` результату з екземпляра винятку (поле ``value``). (Надано Іріт Катріель у :issue:`45711`.)

source: :c:type:`_frozen` has a new ``is_package`` field to indicate whether or not the frozen module is a package. Previously, a negative value in the ``size`` field was the indicator. Now only non-negative values be used for ``size``. (Contributed by Kumar Aditya in :issue:`46608`.)
uk: :c:type:`_frozen` має нове поле ``is_package``, яке вказує, чи є заморожений модуль пакетом. Раніше індикатором було від’ємне значення в полі ``size``. Тепер для ``size`` можна використовувати лише невід’ємні значення. (Надав Кумар Адітя в :issue:`46608`.)

source: :c:func:`_PyFrameEvalFunction` now takes ``_PyInterpreterFrame*`` as its second parameter, instead of ``PyFrameObject*``. See :pep:`523` for more details of how to use this function pointer type.
uk: :c:func:`_PyFrameEvalFunction` тепер приймає ``_PyInterpreterFrame*`` як другий параметр замість ``PyFrameObject*``. Дивіться :pep:`523`, щоб дізнатися більше про те, як використовувати цей тип покажчика функції.

source: :c:func:`PyCode_New` and :c:func:`PyCode_NewWithPosOnlyArgs` now take an additional ``exception_table`` argument. Using these functions should be avoided, if at all possible. To get a custom code object: create a code object using the compiler, then get a modified version with the ``replace`` method.
uk: :c:func:`PyCode_New` і :c:func:`PyCode_NewWithPosOnlyArgs` тепер приймають додатковий аргумент ``exception_table``. Слід уникати використання цих функцій, якщо це можливо. Щоб отримати спеціальний об’єкт коду: створіть об’єкт коду за допомогою компілятора, а потім отримайте модифіковану версію за допомогою методу ``replace``.

source: :c:type:`PyCodeObject` no longer has a ``co_code`` field. Instead, use ``PyObject_GetAttrString(code_object, "co_code")`` or :c:func:`PyCode_GetCode` to get the underlying bytes object. (Contributed by Brandt Bucher in :issue:`46841` and Ken Jin in :gh:`92154`.)
uk: :c:type:`PyCodeObject` більше не має поля ``co_code``. Натомість використовуйте ``PyObject_GetAttrString(code_object, "co_code")`` або :c:func:`PyCode_GetCode`, щоб отримати базовий об’єкт bytes. (Надано Брандтом Бухером у :issue:`46841` та Кеном Джином у :gh:`92154`.)

source: The old trashcan macros (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) are now deprecated. They should be replaced by the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``.
uk: Старі макроси кошика (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) тепер застаріли. Їх слід замінити новими макросами ``Py_TRASHCAN_BEGIN`` і ``Py_TRASHCAN_END``.

source: A tp_dealloc function that has the old macros, such as::
uk: Функція tp_dealloc, яка містить старі макроси, наприклад::

source: should migrate to the new macros as follows::
uk: слід перейти на нові макроси наступним чином:

source: Note that ``Py_TRASHCAN_BEGIN`` has a second argument which should be the deallocation function it is in.
uk: Зауважте, що ``Py_TRASHCAN_BEGIN`` має другий аргумент, який має бути функцією звільнення, у якій він знаходиться.

source: To support older Python versions in the same codebase, you can define the following macros and use them throughout the code (credit: these were copied from the ``mypy`` codebase)::
uk: Щоб підтримувати старіші версії Python у тій самій кодовій базі, ви можете визначити наступні макроси та використовувати їх у всьому коді (автор: їх було скопійовано з кодової бази ``mypy``):

source: The :c:func:`PyType_Ready` function now raises an error if a type is defined with the :const:`Py_TPFLAGS_HAVE_GC` flag set but has no traverse function (:c:member:`PyTypeObject.tp_traverse`). (Contributed by Victor Stinner in :issue:`44263`.)
uk: Функція :c:func:`PyType_Ready` тепер викликає помилку, якщо тип визначено з установленим прапорцем :const:`Py_TPFLAGS_HAVE_GC`, але не має функції переходу (:c:member:`PyTypeObject.tp_traverse`). (Надав Віктор Стіннер у :issue:`44263`.)

source: Heap types with the :const:`Py_TPFLAGS_IMMUTABLETYPE` flag can now inherit the :pep:`590` vectorcall protocol. Previously, this was only possible for :ref:`static types <static-types>`. (Contributed by Erlend E. Aasland in :issue:`43908`)
uk: Типи купи з прапорцем :const:`Py_TPFLAGS_IMMUTABLETYPE` тепер можуть успадковувати протокол векторного виклику :pep:`590`. Раніше це було можливо лише для :ref:`статичних типів <static-types>`. (Надав Erlend E. Aasland у :issue:`43908`)

source: Since :c:func:`Py_TYPE()` is changed to a inline static function, ``Py_TYPE(obj) = new_type`` must be replaced with ``Py_SET_TYPE(obj, new_type)``: see the :c:func:`Py_SET_TYPE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
uk: Оскільки :c:func:`Py_TYPE()` змінено на вбудовану статичну функцію, ``Py_TYPE(obj) = new_type`` потрібно замінити на ``Py_SET_TYPE(obj, new_type)``: див. Функція :c:func:`Py_SET_TYPE()` (доступна з Python 3.9). Для зворотної сумісності можна використовувати цей макрос:

source: (Contributed by Victor Stinner in :issue:`39573`.)
uk: (Надав Віктор Стіннер у :issue:`39573`.)

source: Since :c:func:`Py_SIZE()` is changed to a inline static function, ``Py_SIZE(obj) = new_size`` must be replaced with ``Py_SET_SIZE(obj, new_size)``: see the :c:func:`Py_SET_SIZE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
uk: Оскільки :c:func:`Py_SIZE()` змінено на вбудовану статичну функцію, ``Py_SIZE(obj) = new_size`` потрібно замінити на ``Py_SET_SIZE(obj, new_size)``: див. Функція :c:func:`Py_SET_SIZE()` (доступна з Python 3.9). Для зворотної сумісності можна використовувати цей макрос:

source: ``<Python.h>`` no longer includes the header files ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` and ``<string.h>`` when the ``Py_LIMITED_API`` macro is set to ``0x030b0000`` (Python 3.11) or higher. C extensions should explicitly include the header files after ``#include <Python.h>``. (Contributed by Victor Stinner in :issue:`45434`.)
uk: ``<Python.h>`` no longer includes the header files ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` and ``<string.h>`` when the ``Py_LIMITED_API`` macro is set to ``0x030b0000`` (Python 3.11) або вище. Розширення C мають явно включати файли заголовків після ``#include <Python.h>``. (Надав Віктор Стіннер у :issue:`45434`.)

source: The non-limited API files ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject.h`` and ``longintrepr.h`` have been moved to the ``Include/cpython`` directory. Moreover, the ``eval.h`` header file was removed. These files must not be included directly, as they are already included in ``Python.h``: :ref:`Include Files <api-includes>`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Victor Stinner in :issue:`35134`.)
uk: Необмежені файли API ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject. h`` і ``longintrepr.h`` переміщено до каталогу ``Include/cpython``. Крім того, файл заголовка ``eval.h`` було видалено. Ці файли не можна включати безпосередньо, оскільки вони вже включені в ``Python.h``: :ref:`Включити файли <api-includes>`. Якщо їх було включено напряму, подумайте про те, щоб натомість включити ``Python.h``. (Надав Віктор Стіннер у :issue:`35134`.)

source: The :c:func:`PyUnicode_CHECK_INTERNED` macro has been excluded from the limited C API. It was never usable there, because it used internal structures which are not available in the limited C API. (Contributed by Victor Stinner in :issue:`46007`.)
uk: Макрос :c:func:`PyUnicode_CHECK_INTERNED` було виключено з обмеженого C API. Його ніколи не можна було використовувати там, оскільки він використовував внутрішні структури, які недоступні в обмеженому C API. (Надав Віктор Стіннер у :issue:`46007`.)

source: The following frame functions and type are now directly available with ``#include <Python.h>``, it's no longer needed to add ``#include <frameobject.h>``:
uk: Наступні функції та тип фрейму тепер доступні безпосередньо за допомогою ``#include <Python.h>``, більше не потрібно додавати ``#include <frameobject.h>``:

source: (Contributed by Victor Stinner in :gh:`93937`.)
uk: (Надав Віктор Стіннер у :gh:`93937`.)
