Repository: andriisoldatenko/python-docs-uk
Catalog: whatsnew/3.11.po
Languages: uk

source: Add :attr:`datetime.UTC`, a convenience alias for :attr:`datetime.timezone.utc`. (Contributed by Kabir Kwatra in :gh:`91973`.)
uk: Додайте :attr:`datetime.UTC`, зручний псевдонім для :attr:`datetime.timezone.utc`. (Надав Кабір Кватра в :gh:`91973`.)

source: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` and :meth:`datetime.datetime.fromisoformat` can now be used to parse most ISO 8601 formats (barring only those that support fractional hours and minutes). (Contributed by Paul Ganssle in :gh:`80010`.)
uk: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` і :meth:`datetime.datetime.fromisoformat` тепер можна використовувати для аналізу більшості форматів ISO 8601 (за винятком тих, які підтримують дробові години). і хвилини). (Надав Пол Ганссле в :gh:`80010`.)

source: fractions
uk: частки

source: Support :PEP:`515`-style initialization of :class:`~fractions.Fraction` from string. (Contributed by Sergey B Kirpichev in :issue:`44258`.)
uk: Підтримка :PEP:`515`-стилю ініціалізації :class:`~fractions.Fraction` із рядка. (Надав Сергій Кірпічев у :issue:`44258`.)

source: :class:`~fractions.Fraction` now implements an ``__int__`` method, so that an ``isinstance(some_fraction, typing.SupportsInt)`` check passes. (Contributed by Mark Dickinson in :issue:`44547`.)
uk: :class:`~fractions.Fraction` тепер реалізує метод ``__int__``, щоб перевірка ``isinstance(some_fraction, typing.SupportsInt)`` проходила. (Надав Марк Дікінсон у :issue:`44547`.)

source: :func:`functools.singledispatch` now supports :data:`types.UnionType` and :data:`typing.Union` as annotations to the dispatch argument.::
uk: :func:`functools.singledispatch` тепер підтримує :data:`types.UnionType` і :data:`typing.Union` як анотації до аргументу dispatch.::

source: (Contributed by Yurii Karabas in :issue:`46014`.)
uk: (Надав Юрій Карабас у :issue:`46014`.)

source: hashlib
uk: хешліб

source: :func:`hashlib.blake2b` and :func:`hashlib.blake2s` now prefer `libb2`_ over Python's vendored copy. (Contributed by Christian Heimes in :issue:`47095`.)
uk: :func:`hashlib.blake2b` і :func:`hashlib.blake2s` тепер віддають перевагу `libb2`_ над копією постачальника Python. (Надав Крістіан Хеймс у :issue:`47095`.)

source: The internal ``_sha3`` module with SHA3 and SHAKE algorithms now uses *tiny_sha3* instead of the *Keccak Code Package* to reduce code and binary size. The :mod:`hashlib` module prefers optimized SHA3 and SHAKE implementations from OpenSSL. The change affects only installations without OpenSSL support. (Contributed by Christian Heimes in :issue:`47098`.)
uk: Внутрішній модуль ``_sha3`` з алгоритмами SHA3 і SHAKE тепер використовує *tiny_sha3* замість *Keccak Code Package*, щоб зменшити код і двійковий розмір. Модуль :mod:`hashlib` надає перевагу оптимізованим реалізаціям SHA3 і SHAKE з OpenSSL. Зміна стосується лише встановлення без підтримки OpenSSL. (Надав Крістіан Хеймс у :issue:`47098`.)

source: IDLE and idlelib
uk: IDLE і idlelib

source: Apply syntax highlighting to `.pyi` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
uk: Застосуйте підсвічування синтаксису до файлів `.pyi`. (Надано Алексом Вейгудом і Террі Джен Ріді в :issue:`45447`.)

source: inspect
uk: оглядати

source: Add :func:`inspect.getmembers_static`: return all members without triggering dynamic lookup via the descriptor protocol. (Contributed by Weipeng Hong in :issue:`30533`.)
uk: Додайте :func:`inspect.getmembers_static`: повертає всіх учасників без запуску динамічного пошуку через протокол дескриптора. (Надано Weipeng Hong у :issue:`30533`.)

source: Add :func:`inspect.ismethodwrapper` for checking if the type of an object is a :class:`~types.MethodWrapperType`. (Contributed by Hakan Çelik in :issue:`29418`.)
uk: Додайте :func:`inspect.ismethodwrapper` для перевірки, чи є тип об’єкта :class:`~types.MethodWrapperType`. (Надав Хакан Челік у :issue:`29418`.)

source: Change the frame-related functions in the :mod:`inspect` module to return a regular object (that is backwards compatible with the old tuple-like interface) that include the extended :pep:`657` position information (end line number, column and end column). The affected functions are: :func:`inspect.getframeinfo`, :func:`inspect.getouterframes`, :func:`inspect.getinnerframes`, :func:`inspect.stack` and :func:`inspect.trace`. (Contributed by Pablo Galindo in :gh:`88116`)
uk: Змініть пов’язані з фреймами функції в модулі :mod:`inspect`, щоб повертати звичайний об’єкт (який має зворотну сумісність зі старим кортежним інтерфейсом), який містить розширену інформацію про позицію :pep:`657` (номер кінця рядка, колонка та кінцева колонка). Це стосується таких функцій: :func:`inspect.getframeinfo`, :func:`inspect.getouterframes`, :func:`inspect.getinnerframes`, :func:`inspect.stack` і :func:`inspect.trace`. (Надав Пабло Галіндо в :gh:`88116`)

source: locale
uk: локаль

source: Add :func:`locale.getencoding` to get the current locale encoding. It is similar to ``locale.getpreferredencoding(False)`` but ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
uk: Додайте :func:`locale.getencoding`, щоб отримати поточне кодування мови. Він схожий на ``locale.getpreferredencoding(False)``, але ігнорує :ref:`Режим Python UTF-8 <utf8-mode>`.

source: math
uk: математика

source: Add :func:`math.exp2`: return 2 raised to the power of x. (Contributed by Gideon Mitchell in :issue:`45917`.)
uk: Додати :func:`math.exp2`: повернути 2 у степені x. (Надав Гідеон Мітчелл у :issue:`45917`.)

source: Add :func:`math.cbrt`: return the cube root of x. (Contributed by Ajith Ramachandran in :issue:`44357`.)
uk: Add :func:`math.cbrt`: повертає кубічний корінь з x. (Надав Аджит Рамачандран у :issue:`44357`.)

source: The behaviour of two :func:`math.pow` corner cases was changed, for consistency with the IEEE 754 specification. The operations ``math.pow(0.0, -math.inf)`` and ``math.pow(-0.0, -math.inf)`` now return ``inf``. Previously they raised :exc:`ValueError`. (Contributed by Mark Dickinson in :issue:`44339`.)
uk: Поведінку двох кутових випадків :func:`math.pow` було змінено для узгодженості зі специфікацією IEEE 754. Операції ``math.pow(0.0, -math.inf)`` і ``math.pow(-0.0, -math.inf)`` тепер повертають ``inf``. Раніше вони викликали :exc:`ValueError`. (Надав Марк Дікінсон у :issue:`44339`.)

source: The :data:`math.nan` value is now always available. (Contributed by Victor Stinner in :issue:`46917`.)
uk: Значення :data:`math.nan` тепер завжди доступне. (Надав Віктор Стіннер у :issue:`46917`.)

source: operator
uk: оператор

source: A new function ``operator.call`` has been added, such that ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)``. (Contributed by Antony Lee in :issue:`44019`.)
uk: Додано нову функцію ``operator.call``, так що ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)``. (Надав Ентоні Лі в :issue:`44019`.)

source: os
uk: ос

source: On Windows, :func:`os.urandom` now uses ``BCryptGenRandom()``, instead of ``CryptGenRandom()`` which is deprecated. (Contributed by Dong-hee Na in :issue:`44611`.)
uk: У Windows :func:`os.urandom` тепер використовує ``BCryptGenRandom()`` замість ``CryptGenRandom()``, який є застарілим. (Надав Dong-hee Na у :issue:`44611`.)

source: :meth:`~pathlib.Path.glob` and :meth:`~pathlib.Path.rglob` return only directories if *pattern* ends with a pathname components separator: :data:`~os.sep` or :data:`~os.altsep`. (Contributed by Eisuke Kawasima in :issue:`22276` and :issue:`33392`.)
uk: :meth:`~pathlib.Path.glob` і :meth:`~pathlib.Path.rglob` повертають лише каталоги, якщо *шаблон* закінчується роздільником компонентів шляху: :data:`~os.sep` або :data:`~ос.альцеп`. (Надав Ейсуке Кавасіма в :issue:`22276` і :issue:`33392`.)

source: re
uk: повторно

source: Atomic grouping (``(?>...)``) and possessive quantifiers (``*+``, ``++``, ``?+``, ``{m,n}+``) are now supported in regular expressions. (Contributed by Jeffrey C. Jacobs and Serhiy Storchaka in :issue:`433030`.)
uk: Атомарне групування (``(?>...)`` і присвійні квантори (``*+``, ``++``, ``?+``, ``{m,n}+`` ) тепер підтримуються регулярними виразами. (Надано Джеффрі К. Джейкобсом і Сергієм Сторчакою в :issue:`433030`.)

source: shutil
uk: шутил

source: Add optional parameter *dir_fd* in :func:`shutil.rmtree`. (Contributed by Serhiy Storchaka in :issue:`46245`.)
uk: Додайте необов’язковий параметр *dir_fd* у :func:`shutil.rmtree`. (Надав Сергій Сторчака в :issue:`46245`.)

source: socket
uk: гніздо

source: Add CAN Socket support for NetBSD. (Contributed by Thomas Klausner in :issue:`30512`.)
uk: Додайте підтримку CAN Socket для NetBSD. (Надав Томас Клаузнер у :issue:`30512`.)

source: :meth:`~socket.create_connection` has an option to raise, in case of failure to connect, an :exc:`ExceptionGroup` containing all errors instead of only raising the last error. (Contributed by Irit Katriel in :issue:`29980`).
uk: :meth:`~socket.create_connection` має опцію викликати, у разі невдачі підключення, :exc:`ExceptionGroup`, що містить усі помилки, замість того, щоб викликати лише останню помилку. (Надано Іріт Катріель у :issue:`29980`).

source: You can now disable the authorizer by passing :const:`None` to :meth:`~sqlite3.Connection.set_authorizer`. (Contributed by Erlend E. Aasland in :issue:`44491`.)
uk: Тепер ви можете вимкнути авторизатор, передавши :const:`None` до :meth:`~sqlite3.Connection.set_authorizer`. (Надав Erlend E. Aasland у :issue:`44491`.)

source: Collation name :meth:`~sqlite3.Connection.create_collation` can now contain any Unicode character. Collation names with invalid characters now raise :exc:`UnicodeEncodeError` instead of :exc:`sqlite3.ProgrammingError`. (Contributed by Erlend E. Aasland in :issue:`44688`.)
uk: Назва сортування :meth:`~sqlite3.Connection.create_collation` тепер може містити будь-який символ Юнікоду. Назви зіставлення з недійсними символами тепер викликають :exc:`UnicodeEncodeError` замість :exc:`sqlite3.ProgrammingError`. (Надав Erlend E. Aasland у :issue:`44688`.)

source: :mod:`sqlite3` exceptions now include the SQLite extended error code as :attr:`~sqlite3.Error.sqlite_errorcode` and the SQLite error name as :attr:`~sqlite3.Error.sqlite_errorname`. (Contributed by Aviv Palivoda, Daniel Shahaf, and Erlend E. Aasland in :issue:`16379` and :issue:`24139`.)
uk: Винятки :mod:`sqlite3` тепер включають розширений код помилки SQLite як :attr:`~sqlite3.Error.sqlite_errorcode` та назву помилки SQLite як :attr:`~sqlite3.Error.sqlite_errorname`. (Надано Авівом Паливода, Даніелем Шахафом і Ерлендом Е. Асландом у :issue:`16379` і :issue:`24139`.)

source: Add :meth:`~sqlite3.Connection.setlimit` and :meth:`~sqlite3.Connection.getlimit` to :class:`sqlite3.Connection` for setting and getting SQLite limits by connection basis. (Contributed by Erlend E. Aasland in :issue:`45243`.)
uk: Додайте :meth:`~sqlite3.Connection.setlimit` і :meth:`~sqlite3.Connection.getlimit` до :class:`sqlite3.Connection` для встановлення та отримання обмежень SQLite за підключенням. (Надав Erlend E. Aasland у :issue:`45243`.)

source: :mod:`sqlite3` now sets :attr:`sqlite3.threadsafety` based on the default threading mode the underlying SQLite library has been compiled with. (Contributed by Erlend E. Aasland in :issue:`45613`.)
uk: :mod:`sqlite3` тепер встановлює :attr:`sqlite3.threadsafety` на основі режиму потоків за замовчуванням, з яким скомпільовано базову бібліотеку SQLite. (Надав Erlend E. Aasland у :issue:`45613`.)

source: :mod:`sqlite3` C callbacks now use unraisable exceptions if callback tracebacks are enabled. Users can now register an :func:`unraisable hook handler <sys.unraisablehook>` to improve their debug experience. (Contributed by Erlend E. Aasland in :issue:`45828`.)
uk: :mod:`sqlite3` Зворотні виклики C тепер використовують неможливі винятки, якщо ввімкнено зворотні виклики. Тепер користувачі можуть зареєструвати :func:`unraisable hook handler <sys.unraisablehook>`, щоб покращити свій досвід налагодження. (Надав Erlend E. Aasland у :issue:`45828`.)

source: Fetch across rollback no longer raises :exc:`~sqlite3.InterfaceError`. Instead we leave it to the SQLite library to handle these cases. (Contributed by Erlend E. Aasland in :issue:`44092`.)
uk: Fetch through rollback більше не викликає :exc:`~sqlite3.InterfaceError`. Замість цього ми залишаємо обробку цих випадків бібліотеці SQLite. (Надав Erlend E. Aasland у :issue:`44092`.)

source: Add :meth:`~sqlite3.Connection.serialize` and :meth:`~sqlite3.Connection.deserialize` to :class:`sqlite3.Connection` for serializing and deserializing databases. (Contributed by Erlend E. Aasland in :issue:`41930`.)
uk: Додайте :meth:`~sqlite3.Connection.serialize` і :meth:`~sqlite3.Connection.deserialize` до :class:`sqlite3.Connection` для серіалізації та десеріалізації баз даних. (Надано Erlend E. Aasland у :issue:`41930`.)

source: Add :meth:`~sqlite3.Connection.create_window_function` to :class:`sqlite3.Connection` for creating aggregate window functions. (Contributed by Erlend E. Aasland in :issue:`34916`.)
uk: Додайте :meth:`~sqlite3.Connection.create_window_function` до :class:`sqlite3.Connection` для створення агрегованих віконних функцій. (Надав Erlend E. Aasland у :issue:`34916`.)

source: Add :meth:`~sqlite3.Connection.blobopen` to :class:`sqlite3.Connection`. :class:`sqlite3.Blob` allows incremental I/O operations on blobs. (Contributed by Aviv Palivoda and Erlend E. Aasland in :issue:`24905`)
uk: Додайте :meth:`~sqlite3.Connection.blobopen` до :class:`sqlite3.Connection`. :class:`sqlite3.Blob` дозволяє інкрементні операції вводу/виводу над великими об'єктами. (Надано Aviv Palivoda та Erlend E. Aasland у :issue:`24905`)

source: sys
uk: система

source: :func:`sys.exc_info` now derives the ``type`` and ``traceback`` fields from the ``value`` (the exception instance), so when an exception is modified while it is being handled, the changes are reflected in the results of subsequent calls to :func:`exc_info`. (Contributed by Irit Katriel in :issue:`45711`.)
uk: :func:`sys.exc_info` тепер отримує поля ``type`` і ``traceback`` із ``value`` (екземпляр винятку), тому, коли виняток змінюється під час його обробки, зміни відображаються в результатах наступних викликів :func:`exc_info`. (Надано Іріт Катріель у :issue:`45711`.)

source: Add :func:`sys.exception` which returns the active exception instance (equivalent to ``sys.exc_info()[1]``). (Contributed by Irit Katriel in :issue:`46328`.)
uk: Додайте :func:`sys.exception`, який повертає екземпляр активного винятку (еквівалент ``sys.exc_info()[1]``). (Надано Іріт Катріель у :issue:`46328`.)

source: Add the :data:`sys.flags.safe_path <sys.flags>` flag. (Contributed by Victor Stinner in :gh:`57684`.)
uk: Додайте позначку :data:`sys.flags.safe_path <sys.flags>`. (Надав Віктор Стіннер у :gh:`57684`.)

source: Two new :ref:`installation schemes <installation_paths>` (*posix_venv*, *nt_venv* and *venv*) were added and are used when Python creates new virtual environments or when it is running from a virtual environment. The first two schemes (*posix_venv* and *nt_venv*) are OS-specific for non-Windows and Windows, the *venv* is essentially an alias to one of them according to the OS Python runs on. This is useful for downstream distributors who modify :func:`sysconfig.get_preferred_scheme`. Third party code that creates new virtual environments should use the new *venv* installation scheme to determine the paths, as does :mod:`venv`. (Contributed by Miro Hrončok in :issue:`45413`.)
uk: Додано дві нові :ref:`схеми встановлення <installation_paths>` (*posix_venv*, *nt_venv* і *venv*), які використовуються, коли Python створює нові віртуальні середовища або коли він працює з віртуального середовища. Перші дві схеми (*posix_venv* і *nt_venv*) є специфічними для ОС не-Windows і Windows, *venv* по суті є псевдонімом однієї з них відповідно до ОС, на якій працює Python. Це корисно для дистриб’юторів нижнього рівня, які змінюють :func:`sysconfig.get_preferred_scheme`. Код третьої сторони, який створює нові віртуальні середовища, має використовувати нову схему встановлення *venv* для визначення шляхів, як це робить :mod:`venv`. (Надав Міро Хрончок у :issue:`45413`.)

source: threading
uk: різьблення

source: On Unix, if the ``sem_clockwait()`` function is available in the C library (glibc 2.30 and newer), the :meth:`threading.Lock.acquire` method now uses the monotonic clock (:data:`time.CLOCK_MONOTONIC`) for the timeout, rather than using the system clock (:data:`time.CLOCK_REALTIME`), to not be affected by system clock changes. (Contributed by Victor Stinner in :issue:`41710`.)
uk: В Unix, якщо функція ``sem_clockwait()`` доступна в бібліотеці C (glibc 2.30 і новіша версія), метод :meth:`threading.Lock.acquire` тепер використовує монотонний годинник (:data:`time. CLOCK_MONOTONIC`) для тайм-ауту, замість використання системного годинника (:data:`time.CLOCK_REALTIME`), щоб на нього не впливали зміни системного годинника. (Надав Віктор Стіннер у :issue:`41710`.)

source: time
uk: час

source: On Unix, :func:`time.sleep` now uses the ``clock_nanosleep()`` or ``nanosleep()`` function, if available, which has a resolution of 1 nanosecond (10\ :sup:`-9` seconds), rather than using ``select()`` which has a resolution of 1 microsecond (10\ :sup:`-6` seconds). (Contributed by Benjamin Szőke and Victor Stinner in :issue:`21302`.)
uk: В Unix :func:`time.sleep` тепер використовує функцію ``clock_nanosleep()`` або ``nanosleep()``, якщо вона доступна, яка має роздільну здатність 1 наносекунду (10\ :sup:`-9` секунд), замість використання ``select()``, який має роздільну здатність 1 мікросекунду (10\ :sup:`-6` секунд). (Надано Бенджаміном Секе та Віктором Стіннером у :issue:`21302`.)

source: On Windows 8.1 and newer, :func:`time.sleep` now uses a waitable timer based on `high-resolution timers <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ which has a resolution of 100 nanoseconds (10\ :sup:`-7` seconds). Previously, it had a resolution of 1 millisecond (10\ :sup:`-3` seconds). (Contributed by Benjamin Szőke, Dong-hee Na, Eryk Sun and Victor Stinner in :issue:`21302` and :issue:`45429`.)
uk: У Windows 8.1 і новіших версіях :func:`time.sleep` тепер використовує таймер очікування на основі `таймерів високої роздільної здатності <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_, який має роздільну здатність 100 наносекунд (10\ :sup:`-7` секунд). Раніше він мав роздільну здатність 1 мілісекунду (10\ :sup:`-3` секунди). (Надано Benjamin Szőke, Dong-hee Na, Eryk Sun і Victor Stinner у :issue:`21302` і :issue:`45429`.)

source: typing
uk: введення тексту

source: For major changes, see :ref:`new-feat-related-type-hints-311`.
uk: Для основних змін див. :ref:`new-feat-related-type-hints-311`.

source: Add :func:`typing.assert_never` and :class:`typing.Never`. :func:`typing.assert_never` is useful for asking a type checker to confirm that a line of code is not reachable. At runtime, it raises an :exc:`AssertionError`. (Contributed by Jelle Zijlstra in :gh:`90633`.)
uk: Додайте :func:`typing.assert_never` і :class:`typing.Never`. :func:`typing.assert_never` корисний для запиту перевірки типу, щоб підтвердити, що рядок коду недоступний. Під час виконання він викликає :exc:`AssertionError`. (Надано Jelle Zijlstra у :gh:`90633`.)

source: Add :func:`typing.reveal_type`. This is useful for asking a type checker what type it has inferred for a given expression. At runtime it prints the type of the received value. (Contributed by Jelle Zijlstra in :gh:`90572`.)
uk: Додайте :func:`typing.reveal_type`. Це корисно, щоб запитати засіб перевірки типів, який тип він вивів для даного виразу. Під час виконання він друкує тип отриманого значення. (Надано Jelle Zijlstra у :gh:`90572`.)

source: Add :func:`typing.assert_type`. This is useful for asking a type checker to confirm that the type it has inferred for a given expression matches the given type. At runtime it simply returns the received value. (Contributed by Jelle Zijlstra in :gh:`90638`.)
uk: Додайте :func:`typing.assert_type`. Це корисно для того, щоб попросити засіб перевірки типів підтвердити, що тип, який він вивів для даного виразу, відповідає заданому типу. Під час виконання він просто повертає отримане значення. (Надано Jelle Zijlstra у :gh:`90638`.)

source: :data:`typing.TypedDict` types can now be generic. (Contributed by Samodya Abeysiriwardane in :gh:`89026`.)
uk: Типи :data:`typing.TypedDict` тепер можуть бути загальними. (Надано Samodya Abeysiriwardane у :gh:`89026`.)

source: :class:`~typing.NamedTuple` types can now be generic. (Contributed by Serhiy Storchaka in :issue:`43923`.)
uk: Типи :class:`~typing.NamedTuple` тепер можуть бути загальними. (Надав Сергій Сторчака в :issue:`43923`.)

source: Allow subclassing of :class:`typing.Any`. This is useful for avoiding type checker errors related to highly dynamic class, such as mocks. (Contributed by Shantanu Jain in :gh:`91154`.)
uk: Дозволити підкласи :class:`typing.Any`. Це корисно для уникнення помилок перевірки типу, пов’язаних із високодинамічним класом, таким як mocks. (Надав Шантану Джайн у :gh:`91154`.)

source: The :func:`typing.final` decorator now sets the ``__final__`` attributed on the decorated object. (Contributed by Jelle Zijlstra in :gh:`90500`.)
uk: Декоратор :func:`typing.final` тепер встановлює атрибут ``__final__`` для декорованого об’єкта. (Надано Jelle Zijlstra у :gh:`90500`.)

source: The :func:`typing.get_overloads` function can be used for introspecting the overloads of a function. :func:`typing.clear_overloads` can be used to clear all registered overloads of a function. (Contributed by Jelle Zijlstra in :gh:`89263`.)
uk: Функцію :func:`typing.get_overloads` можна використовувати для самоаналізу перевантажень функції. :func:`typing.clear_overloads` можна використовувати для очищення всіх зареєстрованих перевантажень функції. (Надано Jelle Zijlstra у :gh:`89263`.)

source: The :meth:`__init__` method of :class:`~typing.Protocol` subclasses is now preserved. (Contributed by Adrian Garcia Badarasco in :gh:`88970`.)
uk: Метод :meth:`__init__` підкласів :class:`~typing.Protocol` тепер збережено. (Надано Адріаном Гарсіа Бадараско в :gh:`88970`.)

source: The representation of empty tuple types (``Tuple[()]``) is simplified. This affects introspection, e.g. ``get_args(Tuple[()])`` now evaluates to ``()`` instead of ``((),)``. (Contributed by Serhiy Storchaka in :gh:`91137`.)
uk: Представлення порожніх типів кортежів (``Tuple[()]``) спрощено. Це впливає на самоаналіз, напр. ``get_args(Tuple[()])`` тепер обчислюється як ``()`` замість ``((),)``. (Надав Сергій Сторчака в :gh:`91137`.)

source: Loosen runtime requirements for type annotations by removing the callable check in the private ``typing._type_check`` function. (Contributed by Gregory Beauregard in :gh:`90802`.)
uk: Послабте вимоги до часу виконання для анотацій типу, видаливши перевірку, що викликається, у приватній функції ``typing._type_check``. (Надав Грегорі Борегард у :gh:`90802`.)

source: :func:`typing.get_type_hints` now supports evaluating strings as forward references in :ref:`PEP 585 generic aliases <types-genericalias>`. (Contributed by Niklas Rosenstein in :gh:`85542`.)
uk: :func:`typing.get_type_hints` тепер підтримує обчислення рядків як прямих посилань у :ref:`загальних псевдонімах PEP 585 <types-genericalias>`. (Надав Ніклас Розенштейн у :gh:`85542`.)

source: :func:`typing.get_type_hints` no longer adds :data:`~typing.Optional` to parameters with ``None`` as a default. (Contributed by Nikita Sobolev in :gh:`90353`.)
uk: :func:`typing.get_type_hints` більше не додає :data:`~typing.Optional` до параметрів із ``None`` за замовчуванням. (Надав Микита Соболєв у :gh:`90353`.)
