Repository: andriisoldatenko/python-docs-uk
Catalog: library/asyncio-runner.po
Languages: uk

source: Runners
uk: Бігуни

source: **Source code:** :source:`Lib/asyncio/runners.py`
uk: **Вихідний код:** :source:`Lib/asyncio/runners.py`

source: This section outlines high-level asyncio primitives to run asyncio code.
uk: У цьому розділі описано асинхронні примітиви високого рівня для запуску асинхронного коду.

source: They are built on top of an :ref:`event loop <asyncio-event-loop>` with the aim to simplify async code usage for common wide-spread scenarios.
uk: Вони побудовані на основі :ref:`циклу подій <asyncio-event-loop>` з метою спрощення використання асинхронного коду для звичайних широко поширених сценаріїв.

source: Running an asyncio Program
uk: Запуск асинхронної програми

source: Execute the :term:`coroutine` *coro* and return the result.
uk: Виконайте :term:`coroutine` *coro* і поверніть результат.

source: This function runs the passed coroutine, taking care of managing the asyncio event loop, *finalizing asynchronous generators*, and closing the threadpool.
uk: Ця функція запускає передану співпрограму, піклуючись про керування циклом асинхронних подій, *завершення асинхронних генераторів* і закриття пулу потоків.

source: This function cannot be called when another asyncio event loop is running in the same thread.
uk: Цю функцію не можна викликати, коли в тому самому потоці виконується інший асинхронний цикл подій.

source: If *debug* is ``True``, the event loop will be run in debug mode. ``False`` disables debug mode explicitly. ``None`` is used to respect the global :ref:`asyncio-debug-mode` settings.
uk: Якщо *debug* має значення ``True``, цикл подій запускатиметься в режимі налагодження. ``False`` явно вимикає режим налагодження. ``None`` використовується для дотримання глобальних налаштувань :ref:`asyncio-debug-mode`.

source: This function always creates a new event loop and closes it at the end. It should be used as a main entry point for asyncio programs, and should ideally only be called once.
uk: Ця функція завжди створює новий цикл подій і закриває його в кінці. Його слід використовувати як основну точку входу для асинхронних програм, і в ідеалі його слід викликати лише один раз.

source: Example::
uk: Приклад::

source: Updated to use :meth:`loop.shutdown_default_executor`.
uk: Оновлено для використання :meth:`loop.shutdown_default_executor`.

source: *debug* is ``None`` by default to respect the global debug mode settings.
uk: *debug* за замовчуванням має значення ``None``, щоб дотримуватися глобальних налаштувань режиму налагодження.

source: Runner context manager
uk: Менеджер контексту Runner

source: A context manager that simplifies *multiple* async function calls in the same context.
uk: Менеджер контексту, який спрощує *кілька* викликів асинхронних функцій в одному контексті.

source: Sometimes several top-level async functions should be called in the same :ref:`event loop <asyncio-event-loop>` and :class:`contextvars.Context`.
uk: Іноді в одному :ref:`циклі подій <asyncio-event-loop>` і :class:`contextvars.Context` слід викликати кілька асинхронних функцій верхнього рівня.

source: *loop_factory* could be used for overriding the loop creation. :func:`asyncio.new_event_loop` is used if ``None``.
uk: *loop_factory* можна використовувати для перевизначення створення циклу. :func:`asyncio.new_event_loop` використовується, якщо ``None``.

source: Basically, :func:`asyncio.run()` example can be rewritten with the runner usage::
uk: По суті, приклад :func:`asyncio.run()` можна переписати з використанням бігуна::

source: Run a :term:`coroutine <coroutine>` *coro* in the embedded loop.
uk: Запустіть :term:`coroutine <coroutine>` *coro* у вбудованому циклі.

source: Return the coroutine's result or raise its exception.
uk: Повернути результат співпрограми або викликати її виключення.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The runner's default context is used if ``None``.
uk: Додатковий аргумент *context*, що містить лише ключове слово, дозволяє вказати спеціальний :class:`contextvars.Context` для запуску *coro*. Контекст програми за замовчуванням використовується, якщо ``None``.

source: Close the runner.
uk: Закрийте бігунок.

source: Finalize asynchronous generators, shutdown default executor, close the event loop and release embedded :class:`contextvars.Context`.
uk: Завершіть асинхронні генератори, вимкніть виконавця за замовчуванням, закрийте цикл подій і звільніть вбудований :class:`contextvars.Context`.

source: Return the event loop associated with the runner instance.
uk: Повертає цикл подій, пов’язаний із екземпляром бігуна.

source: :class:`Runner` uses the lazy initialization strategy, its constructor doesn't initialize underlying low-level structures.
uk: :class:`Runner` використовує стратегію відкладеної ініціалізації, його конструктор не ініціалізує базові структури низького рівня.

source: Embedded *loop* and *context* are created at the :keyword:`with` body entering or the first call of :meth:`run` or :meth:`get_loop`.
uk: Вбудований *цикл* і *контекст* створюються під час введення тіла :keyword:`with` або першого виклику :meth:`run` або :meth:`get_loop`.

source: Handling Keyboard Interruption
uk: Обробка переривання клавіатури

source: When :const:`signal.SIGINT` is raised by :kbd:`Ctrl-C`, :exc:`KeyboardInterrupt` exception is raised in the main thread by default. However this doesn't work with :mod:`asyncio` because it can interrupt asyncio internals and can hang the program from exiting.
uk: Коли :const:`signal.SIGINT` викликається :kbd:`Ctrl-C`, :exc:`KeyboardInterrupt` за замовчуванням викликається виняткова ситуація в головному потоці. Однак це не працює з :mod:`asyncio`, оскільки це може призвести до переривання внутрішніх функцій asyncio і призупинити вихід програми.

source: To mitigate this issue, :mod:`asyncio` handles :const:`signal.SIGINT` as follows:
uk: Щоб пом’якшити цю проблему, :mod:`asyncio` обробляє :const:`signal.SIGINT` наступним чином:

source: :meth:`asyncio.Runner.run` installs a custom :const:`signal.SIGINT` handler before any user code is executed and removes it when exiting from the function.
uk: :meth:`asyncio.Runner.run` встановлює спеціальний обробник :const:`signal.SIGINT` перед виконанням будь-якого коду користувача та видаляє його під час виходу з функції.

source: The :class:`~asyncio.Runner` creates the main task for the passed coroutine for its execution.
uk: :class:`~asyncio.Runner` створює основне завдання для переданої співпрограми для її виконання.

source: When :const:`signal.SIGINT` is raised by :kbd:`Ctrl-C`, the custom signal handler cancels the main task by calling :meth:`asyncio.Task.cancel` which raises :exc:`asyncio.CancelledError` inside the main task. This causes the Python stack to unwind, ``try/except`` and ``try/finally`` blocks can be used for resource cleanup. After the main task is cancelled, :meth:`asyncio.Runner.run` raises :exc:`KeyboardInterrupt`.
uk: Коли :const:`signal.SIGINT` викликається :kbd:`Ctrl-C`, спеціальний обробник сигналів скасовує основне завдання, викликаючи :meth:`asyncio.Task.cancel`, що викликає :exc:`asyncio.CancelledError` всередині основного завдання. Це спричиняє розгортання стека Python, блоки ``try/except`` і ``try/finally`` можна використовувати для очищення ресурсу. Після скасування основного завдання :meth:`asyncio.Runner.run` викликає :exc:`KeyboardInterrupt`.

source: A user could write a tight loop which cannot be interrupted by :meth:`asyncio.Task.cancel`, in which case the second following :kbd:`Ctrl-C` immediately raises the :exc:`KeyboardInterrupt` without cancelling the main task.
uk: Користувач може написати щільний цикл, який не можна перервати :meth:`asyncio.Task.cancel`, у цьому випадку другий наступний :kbd:`Ctrl-C` негайно викликає :exc:`KeyboardInterrupt` без скасування основного завдання.
