Repository: andriisoldatenko/python-docs-uk
Catalog: library/sys_path_init.po
Languages: uk

source: The initialization of the :data:`sys.path` module search path
uk: Ініціалізація шляху пошуку модуля :data:`sys.path`

source: A module search path is initialized when Python starts. This module search path may be accessed at :data:`sys.path`.
uk: Шлях пошуку модуля ініціалізується під час запуску Python. Цей шлях пошуку модуля можна отримати за адресою :data:`sys.path`.

source: The first entry in the module search path is the directory that contains the input script, if there is one. Otherwise, the first entry is the current directory, which is the case when executing the interactive shell, a :option:`-c` command, or :option:`-m` module.
uk: Першим записом у шляху пошуку модуля є каталог, який містить вхідний сценарій, якщо він є. Інакше першим записом є поточний каталог, що має місце під час виконання інтерактивної оболонки, команди :option:`-c` або модуля :option:`-m`.

source: The :envvar:`PYTHONPATH` environment variable is often used to add directories to the search path. If this environment variable is found then the contents are added to the module search path.
uk: Змінна середовища :envvar:`PYTHONPATH` часто використовується для додавання каталогів до шляху пошуку. Якщо цю змінну середовища знайдено, її вміст додається до шляху пошуку модуля.

source: :envvar:`PYTHONPATH` will affect all installed Python versions/environments. Be wary of setting this in your shell profile or global environment variables. The :mod:`site` module offers more nuanced techniques as mentioned below.
uk: :envvar:`PYTHONPATH` вплине на всі встановлені версії/середовища Python. Будьте обережні, встановлюючи це у своєму профілі оболонки або глобальних змінних середовища. Модуль :mod:`site` пропонує більш тонкі методи, як зазначено нижче.

source: The next items added are the directories containing standard Python modules as well as any :term:`extension module`\s that these modules depend on. Extension modules are ``.pyd`` files on Windows and ``.so`` files on other platforms. The directory with the platform-independent Python modules is called ``prefix``. The directory with the extension modules is called ``exec_prefix``.
uk: Наступними доданими елементами є каталоги, що містять стандартні модулі Python, а також будь-які модулі розширення (:term:`extension module`)\, від яких залежать ці модулі. Модулі розширення — це файли ``.pyd`` для Windows і файли ``.so`` для інших платформ. Каталог із незалежними від платформи модулями Python називається ``prefix``. Каталог із модулями розширення називається ``exec_prefix``.

source: The :envvar:`PYTHONHOME` environment variable may be used to set the ``prefix`` and ``exec_prefix`` locations. Otherwise these directories are found by using the Python executable as a starting point and then looking for various 'landmark' files and directories. Note that any symbolic links are followed so the real Python executable location is used as the search starting point. The Python executable location is called ``home``.
uk: Змінну середовища :envvar:`PYTHONHOME` можна використовувати для встановлення місць розташування ``prefix`` і ``exec_prefix``. В іншому випадку ці каталоги можна знайти за допомогою виконуваного файлу Python як початкової точки, а потім шукати різні "орієнтири" файли та каталоги. Зверніть увагу, що за будь-якими символічними посиланнями слідує, тому справжнє розташування виконуваного файлу Python використовується як початкова точка пошуку. Розташування виконуваного файлу Python називається ``home``.

source: Once ``home`` is determined, the ``prefix`` directory is found by first looking for :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). On Windows the zip archive is searched for in ``home`` and on Unix the archive is expected to be in :file:`lib`. Note that the expected zip archive location is added to the module search path even if the archive does not exist. If no archive was found, Python on Windows will continue the search for ``prefix`` by looking for :file:`Lib\\os.py`. Python on Unix will look for :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). On Windows ``prefix`` and ``exec_prefix`` are the same, however on other platforms :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) is searched for and used as an anchor for ``exec_prefix``. On some platforms :file:`lib` may be :file:`lib64` or another value, see :data:`sys.platlibdir` and :envvar:`PYTHONPLATLIBDIR`.
uk: Після того як ``home`` визначено, ``prefix`` каталог знайдено, спочатку шукаючи :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). У Windows zip-архів шукають у ``home``, а в Unix очікується, що архів буде в :file:`lib`. Зауважте, що очікуване розташування zip-архіву додається до шляху пошуку модуля, навіть якщо архів не існує. Якщо архів не знайдено, Python у Windows продовжить пошук ``prefix``, шукаючи :file:`Lib\\os.py`. Python в Unix шукатиме :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). У Windows ``prefix`` і ``exec_prefix`` однакові, однак на інших платформах :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib -dynload``) шукається та використовується як прив’язка для ``exec_prefix``. На деяких платформах :file:`lib` може бути :file:`lib64` або іншим значенням, див. :data:`sys.platlibdir` і :envvar:`PYTHONPLATLIBDIR`.

source: Once found, ``prefix`` and ``exec_prefix`` are available at :data:`sys.prefix` and :data:`sys.exec_prefix` respectively.
uk: Після знаходження ``prefix`` і ``exec_prefix`` доступні в :data:`sys.prefix` і :data:`sys.exec_prefix` відповідно.

source: Finally, the :mod:`site` module is processed and :file:`site-packages` directories are added to the module search path. A common way to customize the search path is to create :mod:`sitecustomize` or :mod:`usercustomize` modules as described in the :mod:`site` module documentation.
uk: Нарешті, модуль :mod:`site` обробляється, а каталоги :file:`site-packages` додаються до шляху пошуку модуля. Поширеним способом налаштування шляху пошуку є створення модулів :mod:`sitecustomize` або :mod:`usercustomize`, як описано в документації модуля :mod:`site`.

source: Certain command line options may further affect path calculations. See :option:`-E`, :option:`-I`, :option:`-s` and :option:`-S` for further details.
uk: Певні параметри командного рядка можуть додатково впливати на обчислення шляху. Перегляньте :option:`-E`, :option:`-I`, :option:`-s` та :option:`-S` для отримання додаткової інформації.

source: Virtual environments
uk: Віртуальні середовища

source: If Python is run in a virtual environment (as described at :ref:`tut-venv`) then ``prefix`` and ``exec_prefix`` are specific to the virtual environment.
uk: Якщо Python запускається у віртуальному середовищі (як описано в :ref:`tut-venv`), тоді ``prefix`` і ``exec_prefix`` є специфічними для віртуального середовища.

source: If a ``pyvenv.cfg`` file is found alongside the main executable, or in the directory one level above the executable, the following variations apply:
uk: Якщо файл ``pyvenv.cfg`` знайдено поряд з основним виконуваним файлом або в каталозі на один рівень вище виконуваного файлу, застосовуються такі варіанти:

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing ``prefix`` and ``exec_prefix``.
uk: Якщо ``home`` є абсолютним шляхом і :envvar:`PYTHONHOME` не встановлено, цей шлях використовується замість шляху до основного виконуваного файлу під час виведення ``prefix`` і ``exec_prefix``.

source: _pth files
uk: файли _pth

source: To completely override :data:`sys.path` create a ``._pth`` file with the same name as the shared library or executable (``python._pth`` or ``python311._pth``). The shared library path is always known on Windows, however it may not be available on other platforms. In the ``._pth`` file specify one line for each path to add to :data:`sys.path`. The file based on the shared library name overrides the one based on the executable, which allows paths to be restricted for any program loading the runtime if desired.
uk: Щоб повністю перевизначити :data:`sys.path`, створіть файл ``._pth`` з такою самою назвою, як і спільна бібліотека або виконуваний файл (``python._pth`` або ``python311._pth``). Шлях спільної бібліотеки завжди відомий у Windows, однак він може бути недоступним на інших платформах. У файлі ``._pth`` вкажіть один рядок для кожного шляху, який потрібно додати до :data:`sys.path`. Файл, заснований на імені спільної бібліотеки, замінює файл, заснований на виконуваному файлі, що дозволяє обмежити шляхи для будь-якої програми, яка завантажує середовище виконання, якщо це потрібно.

source: When the file exists, all registry and environment variables are ignored, isolated mode is enabled, and :mod:`site` is not imported unless one line in the file specifies ``import site``. Blank paths and lines starting with ``#`` are ignored. Each path may be absolute or relative to the location of the file. Import statements other than to ``site`` are not permitted, and arbitrary code cannot be specified.
uk: Коли файл існує, усі змінні реєстру та середовища ігноруються, ізольований режим увімкнено, а :mod:`site` не імпортується, якщо один рядок у файлі не вказує ``import site``. Порожні шляхи та рядки, що починаються з "#" ігноруються. Кожен шлях може бути абсолютним або відносним до місця розташування файлу. Інструкції імпорту, окрім ``site``, заборонені, і не можна вказувати довільний код.

source: Note that ``.pth`` files (without leading underscore) will be processed normally by the :mod:`site` module when ``import site`` has been specified.
uk: Зауважте, що файли ``.pth`` (без підкреслення на початку) будуть нормально оброблені модулем :mod:`site`, якщо ``імпортувати сайт`` було вказано.

source: Embedded Python
uk: Вбудований Python

source: If Python is embedded within another application :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure can be used to initialize Python. The path specific details are described at :ref:`init-path-config`. Alternatively the older :c:func:`Py_SetPath` can be used to bypass the initialization of the module search path.
uk: Якщо Python вбудовано в іншу програму, :c:func:`Py_InitializeFromConfig` і структуру :c:type:`PyConfig` можна використовувати для ініціалізації Python. Деталі шляху описані в :ref:`init-path-config`. Як альтернатива, старіший :c:func:`Py_SetPath` можна використовувати для обходу ініціалізації шляху пошуку модуля.

source: :ref:`windows_finding_modules` for detailed Windows notes.
uk: :ref:`windows_finding_modules` для детальних приміток Windows.

source: :ref:`using-on-unix` for Unix details.
uk: :ref:`using-on-unix` для деталей Unix.
