Repository: andriisoldatenko/python-docs-uk
Catalog: library/tomllib.po
Languages: uk

source: :mod:`tomllib` --- Parse TOML files
uk: :mod:`tomllib` --- Аналіз файлів TOML

source: **Source code:** :source:`Lib/tomllib`
uk: **Вихідний код:** :source:`Lib/tomllib`

source: This module provides an interface for parsing TOML (Tom's Obvious Minimal Language, `https://toml.io <https://toml.io/en/>`_). This module does not support writing TOML.
uk: Цей модуль надає інтерфейс для синтаксичного аналізу TOML (мови Tom's Obvious Minimal Language, `https://toml.io <https://toml.io/en/>`_). Цей модуль не підтримує запис TOML.

source: The `Tomli-W package <https://pypi.org/project/tomli-w/>`__ is a TOML writer that can be used in conjunction with this module, providing a write API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
uk: `Пакет Tomli-W <https://pypi.org/project/tomli-w/>`__ — це записувач TOML, який можна використовувати в поєднанні з цим модулем, надаючи API запису, знайомий користувачам модулів стандартної бібліотеки :mod:`marshal` і :mod:`pickle`.

source: The `TOML Kit package <https://pypi.org/project/tomlkit/>`__ is a style-preserving TOML library with both read and write capability. It is a recommended replacement for this module for editing already existing TOML files.
uk: `Пакет TOML Kit <https://pypi.org/project/tomlkit/>`__ — це бібліотека TOML зі збереженням стилю з можливістю читання та запису. Це рекомендована заміна цього модуля для редагування вже існуючих файлів TOML.

source: This module defines the following functions:
uk: Цей модуль визначає такі функції:

source: Read a TOML file. The first argument should be a readable and binary file object. Return a :class:`dict`. Convert TOML types to Python using this :ref:`conversion table <toml-to-py-table>`.
uk: Прочитайте файл TOML. Перший аргумент має бути доступним для читання двійковим файловим об’єктом. Повертає :class:`dict`. Перетворіть типи TOML на Python за допомогою цієї :ref:`таблиці перетворення <toml-to-py-table>`.

source: *parse_float* will be called with the string of every TOML float to be decoded. By default, this is equivalent to ``float(num_str)``. This can be used to use another datatype or parser for TOML floats (e.g. :class:`decimal.Decimal`). The callable must not return a :class:`dict` or a :class:`list`, else a :exc:`ValueError` is raised.
uk: *parse_float* буде викликано з рядком кожного TOML float для декодування. За замовчуванням це еквівалентно ``float(num_str)``. Це можна використовувати для використання іншого типу даних або синтаксичного аналізатора для числа з плаваючою точкою TOML (наприклад, :class:`decimal.Decimal`). Викликаний не повинен повертати :class:`dict` або :class:`list`, інакше виникає :exc:`ValueError`.

source: A :exc:`TOMLDecodeError` will be raised on an invalid TOML document.
uk: Помилка :exc:`TOMLDecodeError` буде викликана в недійсному документі TOML.

source: Load TOML from a :class:`str` object. Return a :class:`dict`. Convert TOML types to Python using this :ref:`conversion table <toml-to-py-table>`. The *parse_float* argument has the same meaning as in :func:`load`.
uk: Завантажте TOML з об’єкта :class:`str`. Повертає :class:`dict`. Перетворіть типи TOML на Python за допомогою цієї :ref:`таблиці перетворення <toml-to-py-table>`. Аргумент *parse_float* має те саме значення, що й у :func:`load`.

source: The following exceptions are available:
uk: Доступні такі винятки:

source: Subclass of :exc:`ValueError`.
uk: Підклас :exc:`ValueError`.

source: Examples
uk: Приклади

source: Parsing a TOML file::
uk: Розбір файлу TOML::

source: Parsing a TOML string::
uk: Розбір рядка TOML::

source: Conversion Table
uk: Таблиця перетворення

source: table
uk: стіл

source: dict
uk: дикт

source: string
uk: рядок

source: str
uk: вул

source: integer
uk: ціле число

source: int
uk: внутр

source: float
uk: плавати

source: float (configurable with *parse_float*)
uk: float (налаштовується за допомогою *parse_float*)

source: boolean
uk: логічний

source: offset date-time
uk: зміщення дати-часу

source: datetime.datetime (``tzinfo`` attribute set to an instance of ``datetime.timezone``)
uk: datetime.datetime (атрибут ``tzinfo`` встановлено на екземпляр ``datetime.timezone``)

source: local date-time
uk: місцева дата-час

source: datetime.datetime (``tzinfo`` attribute set to ``None``)
uk: datetime.datetime (атрибут ``tzinfo`` має значення ``None``)

source: local date
uk: місцева дата

source: datetime.date
uk: датачас.дата

source: local time
uk: місцевий час

source: datetime.time
uk: датачас.час

source: array
uk: масив

source: list
uk: список
